[{"QueryName": "Test Drive Unlimited 2", "ReleaseDate": 2011, "Metacritic": 4, "PriceFinal": 19.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": true, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Test Drive Unlimited 2 transforms the driving genre adding the persistency progression and customization of the latest multiplayer games to the auto racing experience.Test Drive Unlimited 2 blends single player and multiplayer experiences seamlessly creating a dynamic world of evolving content and challenges. Players define their online persona through unparalleled customization of their avatars and vehicles and the acquisition of property clothing and other accoutrements of a luxurious international lifestyle. All-new race types vehicle classes environmental challenges locations and much more push this epic franchise to new levels of performance.Chase glory from behind the wheel of the most exclusive performance cars and take the race online to challenge rivals around the world. Customize your life as you tear through the streets and kick up dust off - road on the sun - kissed islands of Ibiza and Hawaii.Key Features:CONNECT: TDU2 is always live with automatic content updates and seamless online/offline integration.  New content challenges and features will integrate dynamically into the gameplay as the world evolves over time.  SOCIALIZE: A whole new out of car mode where you can walk around shared spaces and interact with other players. New player run clubs are now a huge part of the game. New co-op play; follow the leader keep your distance and enhance the experience within the social networking world.CUSTOMIZE: Unlock a huge range of options and show off your custom avatar to friends and rivals. Customize your car with custom paint jobs decals interiors and trims. Customize every aspect of your avatar -- hair clothes physique and attitude. Buy your dream house or yacht decorate furnish and invite your friends.RACE!: Test Drive Unlimited 2 puts the worlds most desirable vehicles in the players hands. These ultra-limited edition masterpieces are flawlessly replicated with Edens finely tuned driving technology. Unlock vehicles from elite manufacturers such as Gumpert Koenigsegg Aston Martin Audi and more. EXPERIENCE: An all-new single player story mode with compelling character progression.  A dramatic narrative unforgettable characters and immersive cut scenes to draw you in to the vibrant world of Test Drive Unlimited 2.  Single player mode can be experienced offline or as part of the multiplayer experience.  Create your custom avatar and build your fortune.EXPLORE: Hit the streets on a whole new island:  IBIZA.  New terrain types architecture and beautiful vistas bring this legendary location to life.  Take on thousands of unique missions as you explore over two-thousand miles of back roads and black top in this Mediterranean paradise. Additionally you can head to the Ibiza airport and take a flight to Oahu and experience the Hawaiian island as you never have before: with more than 600km of new asphalt and off-road network added as well as completely new missions and challenges.M.O.O.R.(tm): Massively Open Online Racing is back!   Level up your character based on your style of play enjoy all co-op and competitive racing modes and take on other racers that you encounter in our high-speed sandbox.EVOLVE: Dozens of new enhancements features and modes: dynamic weather day/night motion blur car damage a completely new handling model and more.   New core driving modes and game-play: Championship racing school duels cups. Off-road is now featured with a whole new class of vehicle and hundreds of miles of off road tracks now in the game.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/9930/header.jpg", "genre": "Racing"}, {"QueryName": "Blade Kitten", "ReleaseDate": 2014, "Metacritic": 3, "PriceFinal": 2.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": true, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": "In Blade Kitten join Kit Ballard as she explores the mysterious world of Hollow Wish to hunt down rogue mechs and soft targets.", "DetailedDescrip": "Hollow Wish CollectionThe Hollow Wish Collection Contains: The original game (Episode 1) Episode 2 The Hollow Wish Collection comicSoundtrack and Other Comics PackageThe Soundtrack and Other Comics Package contains all the content found in the Soundtrack and Remixes and Comics Pack - Dirty Angels DLC at a discount.About the GameWelcome to Hollow Wish... On the surface its your typical lawless frontier. Yet this mysterious shell planetoid is filled with dark secrets and cloaked figures. Its here Kit Ballard aka Blade Kitten works as one of the best bounty hunters in the business. Dont let her pink hair fool you Kit is part cat part girl and wholly lethal. She is one of the last of her species having fled her homeland after the genocide of her people at the hands of the ancient and mystical race known as the Darques.Kit has since made a name for herself rounding up some of the most deadly scum in the galaxy. With her unique Darque Blade hovering at her side and obeying her every command Kit can cut through even the toughest rogue drone while hunting down soft targets to make the planet a safer place to live. Also along for the ride is Skiffy Kits laid-back little sidekick who when needed serves as her protector.Key features:An epic tail like no otherFollow Kit through 13 levels including 2 exploration levels with her rideable alien mount Noot as she travels around the colorful frenetic world of Hollow Wish.Intuitive scramble style explorationKits innate feline abilities enable her to easily traverse environments and find hidden areas.Pick-up-and-play arcade actionJump right in and easily begin exploring and fighting your way through multiple levels loaded with secret areas and hidden collectibles.Fully voiced dialogueFeaturing a cast of 9 professional voice actors playing a total of 23 characters.Join Kit Skiffy and the Darque Blade in this all new action adventure game!", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/9940/header.jpg", "genre": "Action,Adventure"}, {"QueryName": "The UnderGarden", "ReleaseDate": 2010, "Metacritic": 4, "PriceFinal": 6.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": false, "GenreIsCasual": true, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "The UnderGarden is a casual Zen game that challenges players to explore beautiful underground caverns filled with strange life forms sound music and plenty of hidden secrets.  Casual gamers with an affinity towards puzzle games will enjoy The UnderGardens modern exploration quest filled with brain teasing games that combine state of the art 3D rendering and physics based puzzles. Players traverse large underground worlds in search of members of their musical band. The goal is to bring them together and lead them to the surface.  Along the way players will encounter puzzles that must be solved and strange life forms that must be befriended or avoided.  Provides a truly visceral and relaxing gameplay experience that gamers will enjoy as a contrast to the frenzied action of most popular core titles.Key features:The Pick up and Play mechanics utilizes straightforward accessible controls. Puzzles are physics based solved by placing grown fruit that weighs down levers or lifts up platforms to allow access to new areas.  Environmental puzzles solved by growing exotic plants around the player.  The world springs to life with vibrant color and music as the player drifts past dormant seeds.Serene music and audio is threaded within the game to enhance user experience.Progress is driven by players own pace desire to see their effect on the world and exploration of new environments. First game of its type to offer 2 player co-op play.Casual Zen game design offers 20 different levels each with a unique look.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/9980/header.jpg", "genre": "Casual"}, {"QueryName": "Ghostbusters: Sanctum of Slime", "ReleaseDate": 2011, "Metacritic": 3, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": true, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Strap on your proton packs for an all new ghostbusting adventure!  Ghostbusters: Sanctum of Slime brings paranormal activity to PC Download!  With 4 new playable characters and a whole new team of Ghostbusters get ready for a fast-paced battle against the evil spirits that lurk in New York City to take down Dumazu the Destroyer!Key features:Choose to play as any of the new Ghostbusters crewImmerse yourself in the fight against the paranormal - battle ghosts in sewer tunnels cemeteries and moreGain new weapons to increase your ghostbusting gearRide in the all new ECTO-4WD as you battle evil ghostsCombine weapon attacks with your teammates to increase the power of your attacks", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/9990/header.jpg", "genre": "Action,Adventure"}, {"QueryName": "Call of Duty: World at War", "ReleaseDate": 2008, "Metacritic": 5, "PriceFinal": 19.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Call of Duty is back redefining war like youve never experienced before. Building on the Call of Duty 4(r): Modern Warfare engine Call of Duty: World at War immerses players into the most gritty and chaotic WWII combat ever experienced. Players band together to survive the most harrowing and climactic battles that led to the demise of the Axis powers on the European and Pacific fronts. The title offers an uncensored experience with unique enemies and combat variety including Kamikaze fighters ambush attacks Banzai charges and cunning cover tactics as well as explosive on-screen action through the all new four-player cooperative campaign. The addictive competitive multiplayer has also been enhanced with new infantry and vehicle-based action a higher level cap more weapons and a host of new Perks maps and challenges.                    Harsh New Enemies Environments and Tactics: Face off against ruthless and tactically advanced enemies that will stop at nothing to defend their homelands from swamp ambushes and tree-top snipers to fearless Kamikaze attacks. Play as a U.S. Marine and Russian conscript across a variety of Pacific and European locations against the fearless Imperial Japanese and elite German soldiers in epic adrenaline-filled infantry vehicle and airborne missions.                    Co-Op Campaign Mode Call of Duty Style: For the first time in the franchise Call of Duty: World at War introduces co-op play bringing fresh meaning to No One Fights Alone. Campaign co-op features up to four-players online allowing gamers to experience harrowing campaign missions together for greater camaraderie and tactical execution. Co-op mode incorporates innovative multiplayer components such as challenges rankings and online stats for deeper re-playability and multiplayer experience bonuses. Co-op mode also features Competitive Co-Op that will show who is really the best player on your team.                    Enhanced Innovative Multiplayer: Call of Duty: World at War continues the addictive class-based multiplayer action the series is famous for. The addition of vehicle combat with tanks rounds out the highly-successful Call of Duty 4: Modern Warfare multiplayer experience and features such as persistent stats player rankings upgradeable weapons squad-based gameplay customizable classes and Perks have been further enhanced to set a new standard in Call of Duty online warfare.                    Unprecedented Cinematic Quality in a World at War: Built using the Call of Duty 4: Modern Warfare engine Call of Duty: World at War utilizes cutting-edge technology including highly-detailed character models self-shadowing environmental lighting and amazing special effects to deliver jaw-dropping visuals. Depth of field rim-lighting and texture-streaming technology bring the adrenaline-pumping combat to life while physics-enabled battlefields and fire that spreads through environments realistically immerses players into the harrowing and dynamic combat.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/10090/header.jpg", "genre": "Action"}, {"QueryName": "TimeShift", "ReleaseDate": 2009, "Metacritic": 4, "PriceFinal": 19.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Master time to become the ultimate weapon!                    Dr. Aiden Krone has made a Time Jump across the space-time continuum - a reckless act with frightening consequences. Now a disturbing alternate reality has evolved within the bleak and rain-soaked Alpha District. Armed with the experimental Beta Suit you alone are able to slow stop and reverse the flow of time. Only with this ability can you lead the uprising to victory and put an end to Krones madness.                    Harness time as the Ultimate Weapon: Slow stop and reverse the flow of time to destroy your enemies                    Unleash a powerful arsenal of weapons and vehicles in 24 combat missions                     Up to 16-player multiplayer featuring the use of time grenades in 14 different maps allowing for unique style of slow stop and reversal of time                     Completely customize your multiplayer experience with over 40 different features to fit your style of gameplay                    TimeShift only supports multiplayer connectivity over LAN or direct connection.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/10130/header.jpg", "genre": "Action"}, {"QueryName": "Prototype", "ReleaseDate": 2009, "Metacritic": 4, "PriceFinal": 19.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": true, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "You are the Prototype Alex Mercer a man without memory armed with amazing shape-shifting abilities hunting your way to the heart of the conspiracy which created you; making those responsible pay.                    Fast & Deadly Shape-Shifting Combat: Reconfigure your body to the situation at hand. From Claws to Blades to Hammers to Whips choose the right weapon for the situation. Change to a shield or armor for defense or use advanced sensory powers (thermal vision infected vision) to track your enemies                    Over-the-Top Locomotion & Agility: Seamlessly and fluidly bound from building to building run up walls bounce off cars and everything in your path. Adaptive parkour lets you move freely through the open-world environments of New York City.                    Unique Disguising Abilities: Consume anyone at anytime take on their appearances and assume their memories and special abilities.                    Deep Conspiracy-Driven Storyline: Wake up with no memory of the past...just mysterious powers and a link to a town in Idaho. Delve into the mysteries of your origin the true nature of your power and your part in a conspiracy 40 years in the making.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/10150/header.jpg", "genre": "Action,Adventure"}, {"QueryName": "Call of Duty: Modern Warfare 2", "ReleaseDate": 2009, "Metacritic": 5, "PriceFinal": 19.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": true, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "The most-anticipated game of the year and the sequel to the best-selling first-person action game of all time Modern Warfare 2 continues the gripping and heart-racing action as players face off against a new threat dedicated to bringing the world to the brink of collapse. Call of Duty(r): Modern Warfare 2 features for the first time in video games the musical soundtrack of legendary Academy Award(r) Golden Globe(r) Award Grammy(r) Award and Tony winning composer Hans Zimmer.  The title picks up immediately following the historic events of Call of Duty(r) 4: Modern Warfare(r) the blockbuster title that earned worldwide critical acclaim including:Most Played Online Video Game in history 2009 Guinness World RecordsMore than 50 Game of the Year awards including the Console Game of the Year and Overall Game of the Year 2007 from the Academy of Interactive Arts & Sciences(r)SPECIAL OPS CO-OPERATIVEAn entirely new gameplay mode which supports 2-player co-operative play online that is unique from the single player story campaign.  Special Ops pits players into a gauntlet of time-trial and objective-based missions.Rank-up as players unlock new Special Ops missions each more difficult.Missions include highlights from the single player campaign fan favorites from Call of Duty 4: Modern Warfare and all new exclusive missions.MULTIPLAYER REINVENTEDSetting a new bar for online multiplayer Modern Warfare 2 multiplayer delivers new capabilities customization gamestates and modes including:Create-a-Class EvolvedSecondary Weapons - Machine Pistols Shotguns Handguns LaunchersRiot ShieldsEquipment - Throwing Knives Blast Shield Tactical InsertionPerk UpgradesBling (Dual Attachments)Customizable Killstreaks - AC130 Sentry Gun Predator Missile Counter-UAV Care PackageAccolades (Post match reports)", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/10180/header.jpg", "genre": "Action"}, {"QueryName": "Call of Duty: Modern Warfare 2", "ReleaseDate": 2009, "Metacritic": 5, "PriceFinal": 19.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": true, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "The most-anticipated game of the year and the sequel to the best-selling first-person action game of all time Modern Warfare 2 continues the gripping and heart-racing action as players face off against a new threat dedicated to bringing the world to the brink of collapse. Call of Duty(r): Modern Warfare 2 features for the first time in video games the musical soundtrack of legendary Academy Award(r) Golden Globe(r) Award Grammy(r) Award and Tony winning composer Hans Zimmer.  The title picks up immediately following the historic events of Call of Duty(r) 4: Modern Warfare(r) the blockbuster title that earned worldwide critical acclaim including:Most Played Online Video Game in history 2009 Guinness World RecordsMore than 50 Game of the Year awards including the Console Game of the Year and Overall Game of the Year 2007 from the Academy of Interactive Arts & Sciences(r)SPECIAL OPS CO-OPERATIVEAn entirely new gameplay mode which supports 2-player co-operative play online that is unique from the single player story campaign.  Special Ops pits players into a gauntlet of time-trial and objective-based missions.Rank-up as players unlock new Special Ops missions each more difficult.Missions include highlights from the single player campaign fan favorites from Call of Duty 4: Modern Warfare and all new exclusive missions.MULTIPLAYER REINVENTEDSetting a new bar for online multiplayer Modern Warfare 2 multiplayer delivers new capabilities customization gamestates and modes including:Create-a-Class EvolvedSecondary Weapons - Machine Pistols Shotguns Handguns LaunchersRiot ShieldsEquipment - Throwing Knives Blast Shield Tactical InsertionPerk UpgradesBling (Dual Attachments)Customizable Killstreaks - AC130 Sentry Gun Predator Missile Counter-UAV Care PackageAccolades (Post match reports)", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/10180/header.jpg", "genre": "Action"}, {"QueryName": "Postal 3", "ReleaseDate": 2012, "Metacritic": 2, "PriceFinal": 14.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Good or Insane? The choice is yours.Following the Apocalyptic end to the Postal Dudes week in Paradise we follow him and his insane pitbull Champ as they emigrate to its appropriately named sister city Catharsis. Unfortunately due to the Global Economic Meltdown psychotic left-wing Green extremism and hypocritical Government corruption it turns out Catharsis isnt a much better place to live.What path will you choose when faced with the antics of a hypocritical scheming Mayor? A berserk cartoon mascot with Al Qaeda ties? A former Vice-Presidents cadre of Eco-Zealots? How about Gay Segway biker gangs and a sociopathic cult leader Uncle with nuclear ambitions? Will you give in to your base instincts and fight fire with gasoline? Or will you rise above it to become something more to serve and protect your fellow citizens from the rampant insanity of our modern society?Key features:Edgy satirical Running With Scissors sense of humorA world of twisted parody inspired by real people events and philosophiesLarge detailed interactive environmentsCrazy POSTAL style Vehicle gameplayNPCs react to your behavior in a variety of surprising waysMultiple story paths determined by your behaviorCelebrity characters: Super porn star Ron Jeremy Village People Cowboy Randy Jones Internationally hated film director Uwe Boll and Playboy Playmate Jennifer WalcottAppearances by other popular Running With Scissors character franchises: Krotchy Champ and the Postal Babes who will fight along side you (or sometimes against you!)Insane new gameplay including the Helper Monkey Grenade Cats and the BadgerSawKill Uwe Boll! (or save him!)", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/10220/header.jpg", "genre": "Action"}, {"QueryName": "The Club", "ReleaseDate": 2008, "Metacritic": 4, "PriceFinal": 14.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "The Club(tm) created by critically acclaimed developer Bizarre Creations is a new breed of third-person shooter combining fast-paced run and gun gameplay destructive environments and lethal weapons. You will fight to survive in a shadowy underground blood-sport controlled by a faceless obscenely wealthy and influential elite who place their bets on who will survive as the blood-bath ensues before them. Take control of up to eight uniquely trained killers motivated by greed driven by pure insane bloodlust and hell bent on earning respect on a global level. Rise Through the Ranks of The Club(tm). As one of eight fighters blast your way through five single player game modes including: Sprint Time Attack Survivor Siege and Run the Gauntlet.Earn Respect Online. Shoot your way to the top of the leader boards in over eight cut-throat multiplayer modes. You will face-off with 7 real-time opponents online or battle with your friends offline in 4-player action modes.The Club(tm) is Global. Battle in eight unique real-world locations from around the globe including war-torn cities abandoned factories steel mills and many more.Extreme Gun Battles in Hazardous Environments. A motion blur camera system intensifies the adrenaline rush in both open range and close quarter firefights. Destroy and manipulate objects in the environment to your advantage.Build up the highest score. A unique score-based accumulation system creates even more competition among players; the faster more efficient and accurate that you are the more points you will earn to unlock weapons characters and maps.Select from an Arsenal of Weaponry. There are 17 high-powered assault weapons to choose from and customize including Automatic Weapons Sniper Rifles High Caliber Pistols Sub Machine Guns Mounted Weapons and many more.Each Character has a Story to Tell. Choose from eight different characters to rise through the ranks of The Club(tm) and uncover each persons true motives and intentions.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/10460/header.jpg", "genre": "Action"}, {"QueryName": "Empire: Total War", "ReleaseDate": 2009, "Metacritic": 5, "PriceFinal": 19.99, "PlatformWindows": true, "PlatformLinux": true, "PlatformMac": true, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": true, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": "Command the seas control the land forge a new nation and conquer the globe.", "DetailedDescrip": "Just UpdatedMac version available now!About the GameABOUT EMPIRE: TOTAL WAR Dominate the 18th century on land and sea. Command the seas control the land forge a new nation and conquer the globe. Empire: Total War takes the Total War franchise to the eighteenth century Age of Enlightenment  a time of political upheaval military advancements and radical thought captured in stunning detail in Empire: Total War.                    Empire: Total War introduces a host of revolutionary new features including true 3D naval combat. For the first time in the Total War series you will be able to intuitively command single ships or vast fleets upon seascapes rich with extraordinary water and weather effects that play a huge role in your eventual glorious success or ignominious defeat. After pummelling your enemy with cannon fire close in to grapple their ship and prepare to board taking control of your men as they fight hand-to-hand on the decks of these wooden behemoths.                    In addition Empire: Total War will see further enhancements to the Total War series signature 3D battles and turn-based campaign map. Real-time battles will pose new challenges with the addition of cannon and musket challenging players to master new formations and tactics as a result of the increasing role of gunpowder within warfare. And the Campaign Map  for many the heart of Total War  introduces a variety of new and upgraded elements including new systems for Trade Diplomacy and Espionage with agents; a refined and streamlined UI; improved Advisors; and a vastly extended scope taking in the riches of India the turbulence of Europe and for the first time the untapped potential of the United States of America.                    Take command on the high seas. New real-time 3D naval warfare takes Total Wars unparalleled battle action to the high seas with players commanding single ships or vast fleets.                    Become a founding father. Starting in 1700  The era of warfare across oceans revolution and the founding of the United States.                    All new graphics engine and technology features staggering real-time seascapes new advanced landscape and flora systems and dynamic weather.                    March 31 2010 - Update Update 1.6 for Empire: Total War is available today. The update introduces a large number of revisions to the Artificial Intelligence in real time battles. Amongst many other improvements the Battle A.I. now maintains its lines more rigorously has better army movement and engages in melee more tactically. It is also better at protecting its own advance and engaging opponents with flanking attacks.  October 5 2009 - Update Performance and other general improvements to Empire: Total War have just been released in conjunction with the new Warpath Campaign DLC. Read on for a full list of features included with this update.  September 22 2009 - UpdateThis update now available on Steam adds two new historical battles: Battle of Rossbach and Battle of Fontenoy. Both are available in single player and multiplayer game modes. Read on for a full list of features included with this update.  June 22 2009 - UpdateEmpire is expanding. With its latest update now available on Steam Empire: Total War adds 14 free new units along with numerous updates and game enhancements. Read on for a full list of features included with this update.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/10500/header.jpg", "genre": "Strategy"}, {"QueryName": "Space Siege", "ReleaseDate": 2008, "Metacritic": 4, "PriceFinal": 14.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": true, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "A game filled with heavy combat action fast-paced tactics and decision making Space Siege is an all-new science fiction themed action-RPG being developed by Chris Taylor and his talented team at Gas Powered Games the creators of Dungeon Siege I & II and Supreme Commander.                                                                         As humans are fleeing the planet during a massive alien attack on Earth only one of five evacuation colony ships escapes intact before Earth is completely obliterated by the attacking aliens. In Space Siege you take on the role of Seth Walker a combat engineer aboard the Armstrong (the lone surviving ship). Your objective is to protect the human race from being annihilated by this unknown alien species. Ultimately you must make a horrific choice: will you sacrifice your humanity to save the human race?                                                                        At your disposal will be an arsenal of futuristic weaponry and armor cybernetic upgrades and a robotic partner that you can customize and command. Space Siege will also feature a single-player campaign that takes place across the vast confines of the Armstrong a separate mission-based multiplayer campaign character-building gameplay elements and a storyline that asks: What does it mean to be human?                                                  Features:                                                Tactical Combat Action - Outsmart your enemies by setting up ambushes dodging attacks ducking behind cover and using any of the multiple special abilities available to you.                         Multiple Gameplay Paths - Define your game experience with the decisions you make. Will you remain truly human in the face of insurmountable odds? Or will you enhance your abilities with cybernetic technology to even the score? Customize your character with multiple skills and special abilities that fit your style of play but realize all your decisions will have repercussions.                        Customizable Robotic Partner - Upgrade HR-V your robot companion with armor weapons and special equipment. Command HR-V to perform offensive and defensive tactical combat maneuvers or combine your efforts and unleash special attack combos.                        Chilling Sci-Fi Story - Follow a multi-chapter storyline and make key decisions that determine the best means to deal with the ferocious alien menace. Interact with dozens of characters with their own histories and personalities - no more generic NPCs.                        Online Multiplayer - Up to 4 players can play cooperatively in a separate multiplayer campaign designed specifically for online play. Customize enemy difficulty and toughness to best fit your skill level.                        Futuristic Combat Technology - Access high-tech weaponry and armor in addition to advanced cybernetic upgrades that will offer powerful abilities with both risks and benefits.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/10530/header.jpg", "genre": "Action,RPG"}, {"QueryName": "Aliens vs. Predator", "ReleaseDate": 2010, "Metacritic": 4, "PriceFinal": 14.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": "Survive hunt and prey in the deadly jungles and swamps in distinctly new and thrilling first person gameplay.", "DetailedDescrip": "Bringing the legendary war between two of science-fictions most popular characters to FPS fans AvP delivers three outstanding single player campaigns and provides untold hours of unique 3-way multiplayer gaming. Experience distinctly new and thrilling first person gameplay as you survive hunt and prey in the deadly jungles and swamps surrounding the damned colony of Freyas Prospect. As the Marine youll experience a claustrophobic and terrifying experience where light is your friend but theres never enough. However the United States Marine Corps are humanitys last line of defense and as such they are armed to the teeth with the very latest in high explosive and automatic weaponry. As the Predator you will stalk from the shadows and from above passing athletically through the treetops to ambush your victims. Although equipped with an array of powerful exotic weapons and tracking equipment honor ultimately dictates that you must get in close and take your trophies face to face. As the most deadly species in the universe the Alien offers you the chance to play as the very stuff of nightmares - the monster in the dark swarming forward with countless others jaws like a steel trap and claws like blades. Play all sides off against each other in a series of unique 3-way online modes and go tooth-to-claw-to-pulse rifle in the reinvention of one of multiplayer gamings defining moments. AvP uses the Steam Cloud to store game stats and skill information which is then used for matchmaking purposes.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/10680/header.jpg", "genre": "Action"}, {"QueryName": "Sherlock Holmes: Nemesis", "ReleaseDate": 2008, "Metacritic": 4, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": true, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": true, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "This new Sherlock Holmes game sends us to 19th Century London where Arsene Lupin a young French burglar with an impressive track record has just challenged Scotland Yard and the most famous of detectives - Sherlock Holmes.                                    This new adventure offers gamers tremendous freedom and an even stronger sense of involvement through real-time 3D. The game invites you to visit 19th century London in all its splendor and to travel through superb decors which have been faithfully reproduced.                         Features            The magnificent city of London with all its most famous monuments (Buckingham Palace the British Museum the National Gallery the Tower of London...) is faithfully created for the scenes of investigation            Meet the Queen of England in a very private interview.            Interact with more than 40 characters to further your inquiry.             Take turns being the famous detective Sherlock Holmes and his faithful friend Doctor Watson.             Use and combine more than 100 objects and discover hundreds of clues and documents to help you bring the investigation to its conclusion.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/11040/header.jpg", "genre": "Adventure,RPG"}, {"QueryName": "Dracula: Origin", "ReleaseDate": 2008, "Metacritic": 4, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": true, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Dracula: Origin reveals the dark origins of the Dracula curse. Once the ardent defender of Christendom Dracula loses his faith in God when he is abandoned by his one true love after she marries. Dracula then makes a pact with the Prince of Darkness and becomes a vampire. As time goes by Dracula discovers the existence of a manuscript that allegedly details a rite which brings damned souls back from the beyond.                    In Dracula: Origin the player takes the role of the famous Professor Van Helsing whose lifes aim is the destruction of Dracula. Van Helsing must stop the vampire from finding the manuscript. A rich adventure that takes him from London to Egypt Austria and through Carpathian Europe right into the terrifying home of the Dark Prince.                    Features:                    A fantastic gothic romantic atmosphere faithful to Bram Stokers original universe for a total immersion in the adventure.                    A relentless hunt throughout several countries in pursuit of one of the most terrifying characters in fantastic literature.                    Superb graphics combining 2D environments and 3D characters backed by an excellent scenario.                    Interact with more than 40 characters. Use and combine more than 150 objects belonging to the vampire world (stake statue garlic mirror and many more).                    Help system that shows the interactive possibilities (objects and actions) to help players in need.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/11050/header.jpg", "genre": "Adventure"}, {"QueryName": "Sherlock Holmes: The Mystery of The Mummy", "ReleaseDate": 2009, "Metacritic": 4, "PriceFinal": 0.0, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": true, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Inspired by The adventures of Sherlock Holmes Written by Sir Arthur Conan Doyle.After Lord Montcalfes death his daughter Elisabeth turns to the famous detective Sherlock Holmes to solve the mystery that surrounds her fathers death. As his trusted assistant Doctor Watson  is having a well deserved holiday with his family Holmes decides to go to the manor on his own. He will have to use all of his considerable skill to resolve all the manors riddles. Only then will he discover that behind this mysterious case hides a dreadful secret.In The Mystery of the Mummy youll be immersed in an incredible adventure full of mysteries and with many developments. Take on the role of the famous detective Sherlock Holmes and get ready to avoid numerous traps and to solve riddles. A mysterious murder numerous suspects and the famous mummy for a case that appears to be not that easy...", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/11130/header.jpg", "genre": "Adventure"}, {"QueryName": "Sherlock Holmes: The Awakened - Remastered", "ReleaseDate": 2009, "Metacritic": 4, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": true, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "The Sherlock Holmes series returns with this updated version of The Awakened which brings a whole new dimension to the original title developed by Frogwares.Keeping with the traditional Point & Click gameplay style of the original adventure games The Awakened has been totally rethought offering players a new third-person view while keeping the original first-person view available also.The game puts the player into an investigation of the myth of Cthulhu - as imagined by author H.P. Lovecraft.  Sherlock Holmes assisted by the loyal Doctor Watson investigates strange disappearances which seem related to the activity of a secret sect. The adventure begins in London in the renowned Baker Street taking us to investigate a disturbing psychiatric hospital near Bale Switzerland on to Louisiana and finally to Scotland.Key Features2 points-of-view available at all times: new gameplay in 3rd person giving a new dimension to the original game or classic first- person point-of-view.An original confrontation between the universe of Sherlock Holmes and the myth of Cthulhu - a fight between the rational and the supernatural.Rich graphics biting dialogue disturbing characters and an excellent sound track create incredible turn of the century atmospheres.Play as the famous detective Sherlock Holmes and his loyal friend Doctor Watson.A new help system that shows the interactions available (objects and actions).Interact with more than 60 characters in 5 disturbing universes.Use and combine more than 50 objects and discover hundreds of clues and documents to carry out the investigation to its final outcome.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/11140/header.jpg", "genre": "Adventure"}, {"QueryName": "Sherlock Holmes: The Secret of the Silver Earring", "ReleaseDate": 2009, "Metacritic": 4, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": true, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "At a reception organised in honour of his daughter Melvyn Bromsby a rich tycoon is about to make an important announcement concerning his future business affairs when all of a sudden a shot rings out. Sir Bromsby collapses having suffered a mortal wound to the heart...A baffling murder dozens of witnesses and numerous places to visit around Victorian London. You play Sherlock Holmes and use all your skills to shed light on this mysterious case.Assume the role of Sherlock Holmes and Doctor Watson and meet all the heroes of the novels: Inspector Lestrade Wiggins Mycroft and many others!Investigate 5 murders! Over 40 witnesses to question 200 clues to uncover and over 25 hours of gameplay to solve the mystery.Explore Victorian London which is magnificently and faithfully reproduced in 3D. Between each level Sherlock Holmes sets you a quiz which will validate your progress in the case.The adventure is full of vivid cut scenes to heighten the dramatic aspect of the story.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/11150/header.jpg", "genre": "Adventure"}, {"QueryName": "Sherlock Holmes versus Jack the Ripper", "ReleaseDate": 2009, "Metacritic": 4, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": true, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": true, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Recognized as one of the best licenses in adventure gaming and lauded by the international press Sherlock Holmes is back with an investigation that is sure to be the most horrifying of the series. In this great new adventure the famous detective chases against the most threatening serial killer England has ever known - Jack the Ripper.Its 1888 London in the Whitechapel area and a series of grisly crimes in the heart of the East End leave a gory trail of mutilated female bodies. The police struggle to pick up the scent as the bodies pile up and paranoia sweeps the city. Sherlock Holmes immerses himself in the dark sordid alleyways of Whitechapel in order to follow the trail of the one that the press calls Jack the Ripper. During a terrifying investigation Holmes will attempt to lift the veil of mystery that shrouds the motives and the face behind that horrific nickname.Presented in full 3D Sherlock Holmes vs. Jack the Ripper offers players 2 different perspectives available at any moment in the game: a third-person view in the pure style of traditional point n click adventure games and a first-person view for close-up investigation. Players have the total freedom to choose either of the angles they wish or use them both to immerse themselves completely in this terrifying adventure.Features Solve one of the greatest mysteries in the history of England and discover who is Jack the Ripper!2 mythic characters of 19th century England engage in a horrifying manhunt: the illustrious Sherlock Holmes and the terrifying Jack the Ripper.Discover the hidden side of London and the sinister streets of Whitechapel all faithfully recreated (e.g. public work house hospitals brothels etc).Switch between playing the role of the famous detective Sherlock Holmes or his trusted friend Doctor Watson.Interact with more than 30 authentic characters that help you complete your investigation.Use and combine more that 100 objects and collect hundreds of clues so you can finally uncover the real identity and motives of the perverted Jack the Ripper.2 points-of-view available at all times: gameplay in third-person or classic first-person point-of-view a favorite for the enthusiasts of the series.A progressive help system puts you back on track whenever you need assistance.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/11190/header.jpg", "genre": "Adventure,RPG"}, {"QueryName": "Shadowgrounds: Survivor", "ReleaseDate": 2007, "Metacritic": 4, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": true, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Surviving is only half the game.The award-winning atmosphere and gameplay mechanics of the original Shadowgrounds make a triumphant return in this spin off/sequel armed with a slick new feature set!Shadowgrounds Survivor tells the story of the last remaining humans on Jupiters moon Ganymede where the alien onslaught is in full force.3 playable characters with impressive new tacticsRPG-like upgrade system for weapons and characters - including special attacks such as the all-engrossing Napalm Flame and the mighty Brute Slayer.Campaign mode deepens the Shadowgrounds story and expands it to new locations including snow and ice environments an abandoned cargo tunnel and the suffering New Atlantis colony.Survival mode focuses on all-out alien slaughtering action - choose a character to suit your playing style and blast the aliens back to outer space! New gameplay features such as the Sentry Turret and the powerful Mech!New graphics enhancements including raging snowstorm effects new weapon effects and much more.AGEIA PhysX brings the world alive with hundreds of physics objects that take the destruction to the next level.Editor tools allow players to take part in the active Shadowgrounds mod community - or just enjoy the results!", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/11200/header.jpg", "genre": "Action"}, {"QueryName": "Pacific Storm", "ReleaseDate": 2008, "Metacritic": 4, "PriceFinal": 7.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": true, "GenreIsRPG": false, "GenreIsSimulation": true, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": "On December 7 1941 a major part of the U.S. Pacific navy stationed at Pearl Harbor was assaulted by Japanese planes. Japanese fighters were destroying American aircraft on land and in the air without giving them a chance for a counterattack. The furious battle of Pearl Harbor became the first in the sequence of gory sea combats.", "DetailedDescrip": "Steam Summer Sale.  Special Event from  BUKA Entartainment----------------------------- JURASSIC QUEST. THE END!---------------------------- Thank you friends! We have passed all quests days and found all little Boo-Bukas! It was our first that kind of Event on Steam. And we never saw it from other publishers or developers on Steam! We tried to make this event curious and fun!* Of course there were some issues during event but I hope that nobody was unhappy!We would like to make a lot of interesting and unusual events in this year!Follow BUKA Entertainment on Steam!  -------------------------------- FOR ALL WINNERS! --------------------------------Choose your prizes games! Add Salut_Michel to your friends list! Send the message with your choice! THE FINAL DAY PASSED! Eleven games for two winners!Unfortunatelly Jurassic Quest came to the end. Congratulations our last winners: NAMELESS became the first on Russian region! There were 34 Boo-Bukas! Nerney9   was the first who found all 40 Boo-Bukas of worldwide group! It was LAST DAY!---------------- You can read history of quest day by day HERE! ---------------About the GameOn December 7 1941 a major part of the U.S. Pacific navy stationed at Pearl Harbor was assaulted by Japanese planes. Japanese fighters were destroying American aircraft on land and in the air without giving them a chance for a counterattack. The furious battle of Pearl Harbor became the first in the sequence of gory sea combats.Now you can take part in all major Pacific battles of World War II. Pacific Storm is a mixture of Real-Time Strategy war-game and simulator. All major and important sea battles of World War II which took place in the Pacific Ocean are included and you can play either for the USA or Japan.Mine the resources (money iron and nickel ore bauxites and oil) train various units and retaliate! Sinkem all!Engaging WWII action in the Pacific combat theater viewable in both a strategic map and tactical battleground modeClassic RTS elements such as technology research unit development and deployment combined with gripping white-knuckle player-controlled combat actionHuge variety of historically inspired units with focus on naval and air units including bombers fighters battleships aircraft carriers and other power hitters of the Japanese and U.S. Pacific fleetsMultiplayer LAN gameplay supports both action and tactical playBeautifully rendered landscapes and bodies of water provide stunning backdrops for both in-flight and on-the-ground action", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/11250/header.jpg", "genre": "Strategy,Simulation"}, {"QueryName": "Pacific Storm: Allies", "ReleaseDate": 2008, "Metacritic": 4, "PriceFinal": 7.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": true, "GenreIsRPG": false, "GenreIsSimulation": true, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": "Pacific Storm: Allies expands upon the success of the internationally acclaimed original to deliver an unforgettable mix of real-time strategy and blistering arcade combat recreating World War IIs most heated battles.", "DetailedDescrip": "Steam Summer Sale.  Special Event from  BUKA Entartainment----------------------------- JURASSIC QUEST. THE END!---------------------------- Thank you friends! We have passed all quests days and found all little Boo-Bukas! It was our first that kind of Event on Steam. And we never saw it from other publishers or developers on Steam! We tried to make this event curious and fun!* Of course there were some issues during event but I hope that nobody was unhappy!We would like to make a lot of interesting and unusual events in this year!Follow BUKA Entertainment on Steam!  -------------------------------- FOR ALL WINNERS! --------------------------------Choose your prizes games! Add Salut_Michel to your friends list! Send the message with your choice! THE FINAL DAY PASSED! Eleven games for two winners!Unfortunatelly Jurassic Quest came to the end. Congratulations our last winners: NAMELESS became the first on Russian region! There were 34 Boo-Bukas! Nerney9   was the first who found all 40 Boo-Bukas of worldwide group! It was LAST DAY!---------------- You can read history of quest day by day HERE! ---------------About the GameThe long-awaited sequel to Pacific Storm; Pacific Storm: Allies expands upon the success of the internationally acclaimed original to deliver an unforgettable mix of real-time strategy and blistering arcade combat recreating World War IIs most heated battles.                                                            Experience large-scale naval and air operations of the Pacific as either the United States Imperial Japan or new playable nation - the UK. Marvel at the enhanced 3D visual engine complete with detailed damage modeling. Settle disputes via diplomacy or battle. Or assume direct control over stunningly-rendered ships and planes to personally annihilate your adversaries. From the US to USSR Germany to Japan new missions tactical maneuvers and multiplayer modes offer armchair admirals greater excitement than ever.                                                            Whether you chart the conflicts progress from a strategic level or man a deck gun or get behind the controls of a fighter or bomber and personally take the fight to your foes seize the day and rewrite history of some the most intense battles of World War II!                                                 ENGROSSING WORLD WAR II ACTION AND STRATEGY - Diplomats strategists and fighter jocks will all have a place in the game; seize the day from behind a deck gun in a planes cockpit or as an admiral in the fleets strategic planning room.                     NEW NATIONS - Play as the United States Japan and now as Great Britain. Ally with the AI-controlled Soviet Union Holland or Germany using updated diplomacy features.                    A MASSIVE ASSORTMENT OF HISTORICALLY-BASED UNITS - Employ bombers fighters submarines battleships aircraft carriers and other power hitters of the Second World War. Go beyond the Pacific Theater and even command the Bismarck or HMS Hood.                     ENHANCED GRAPHICS - An updated 3D graphics engine beautifully renders units including detailed damage modeling and persistent combat effects.                    REVAMPED CONTROLS - Master grand strategy new technology development or in-your-face combat with a newly updated control scheme that streamlines everything from resource management to dog-fighting.                     MULTIPLAYER MAYHEM: Play head-to-head in action-oriented dogfights join in cooperative mode with friends or play competitively against the AI and online opponents to succeed in historical missions or massive theater-wide campaigns.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/11260/header.jpg", "genre": "Strategy,Simulation"}, {"QueryName": "Larva Mortus", "ReleaseDate": 2009, "Metacritic": 4, "PriceFinal": 4.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": true, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "At the end of 19th Century dark forces shade the world once again. A brave agent experienced in exorcism and combat comes to face the oncoming evil and fight loathsome supernatural monsters and horrific spawns of black magic. In the role of the agent its your quest to combat evil forces and to face a dark warlock of the ancient times and stop his plan to capture powerful artifacts of black magic.                    Larva Mortus is a fast-paced action horror game that has you hunting monsters of the supernatural in a dark and ominous atmosphere full of undead terrifying and demonic nightmares. A horrific atmosphere goes hand in hand with furious action packed splatter fest. Everything accompanied by creepy first class soundtrack!                    30 frightening supernatural monsters to destroy. Vampires werewolves the undead and more!                     A dark and horrifying atmosphere with mysterious storyline quests!                     A solid arsenal  varying from classic six shooters and shotguns to the fancy Dynamo Gun                     Randomly generated missions for high replay value                     Main character development through a set of RPG-like features                     Many environments  from spooky manors and catacombs to dark forests and lonely deserts                     An awesome dark orchestral music score                     The gore can be turned off if you like                    Unlock 25 morbid Steam Achievements to gain bonuses and upgrade your character", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/11340/header.jpg", "genre": "Indie,Action"}, {"QueryName": "Nikopol: Secrets of the Immortals", "ReleaseDate": 2009, "Metacritic": 4, "PriceFinal": 4.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": true, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "From the art and stories of famed graphic novelist and filmmaker Enki Bilal and the studio created by adventure game legend Benoit Sokal comes Nikopol: Secrets of the Immortals. Set in France in the year 2023 the country is governed by a dictator who rules by religious absolute power. A mysterious ship shaped like a pyramid has just appeared in the sky and sent representatives to speak with the French government. As Nikopol you will find yourself in a suspenseful adventure to find your father and thwart a dangerous conspiracy. Entangled in political intrigue youre caught between two worlds one of anarchy and one of immortality.A thrilling mental challenge in a rich futuristic universe inspired by famed graphic novelist Enki BilalAs Nikopol you must use cunning and logic to protect yourself from the Immortals plans and thwart a dark conspiracyInteraction with 8 characters in 6 different environments each made of several settings Visually stunning graphicsImmersive gameplayClassic point and click interface", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/11370/header.jpg", "genre": "Adventure"}, {"QueryName": "Overlord", "ReleaseDate": 2009, "Metacritic": 5, "PriceFinal": 4.99, "PlatformWindows": true, "PlatformLinux": true, "PlatformMac": true, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": true, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Prepare to be tempted mesmerized and thrilled become the Overlord how corrupt you become depends on how you handle any given situation. Your actions impact the game world. With incredible power at your disposal and a team of evil minded minions to do your evil bidding how will you resist the temptation to be incredibly despotic? THINK EVIL BREED EVIL CONTROL ALL!Control a horde of Minions Intuitive control over a crowd of evil minded minion creaturesUse Minions to smash destroy kill steal and intimidateBecome the OverlordForge loot from the battlefield into powerful weapons and armourGain Overlord powers such as the ability to make enemies burst into flames and cower down before youConquer the world and impose your will on its peopleExplore a twisted fantasy worldA unique story that combines evil bidding with impish humourDefeat the seven fallen heroes to rule over all the world", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/11450/header.jpg", "genre": "RPG"}, {"QueryName": "Soldiers: Heroes of World War II", "ReleaseDate": 2014, "Metacritic": 4, "PriceFinal": 4.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": true, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": "The player can take control of American British Russian or German forces to play out battles that are set in World War II. The game is primarily a strategy game but the player can take control of his or her forces and direct them with the keyboard and mouse for additional depth of control.", "DetailedDescrip": "The player can take control of American British Russian or German forces to play out battles that are set in World War II. The game is primarily a strategy game but the player can take control of his or her forces and direct them with the keyboard and mouse for additional depth of control.        Command or commandeer over 100 authentic vehicles and weapons               Battle through a variety of ultra-detailed terrain from coastal waters to Normandy villages            Fire from cover or hide from the enemy with totally interactive scenery Fight as BritishAmericans Russians or Germans through more than 30 intense missionsGet into the thick of the action with Direct Control of each unit or command your elite squad with RTS-style gameplay            Engage cunning AI enemies as they counter your plans with real battlefield tactics                                  Multiplayer: LAN. Internet multiplayer is possible with the help of third-party software", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/11480/header.jpg", "genre": "Strategy"}, {"QueryName": "Maelstrom", "ReleaseDate": 2009, "Metacritic": 3, "PriceFinal": 4.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": true, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "In the space of fifty years Earth changed from a planet on cusp of a challenging future to a world a breath away from lifelessness and plunged into an apocalyptic time of ecological disaster global warfare and the meltdown of human civilization. This is the time of the Maelstrom. In this ravaged world the planets dwindling resources have divided what remains of mankind in two: the urban freedom fighting Remnants and the technologically advanced Ascension. Now they must wage war against a new threat the invasion of a savage alien race the Hai-Genti and each other in a desperate struggle for supremacy and survival. Through the games missions take command from different viewpoints and employ faction-specific tactics and weaponry to achieve your objectives. Complete with the ability to terraform landscapes and transform units Maelstrom provides gamers with the power to harness the forces of nature in the most frantic destructive action-packed RTS game yet.                    A stunning mix of action-packed RTS missions set in a totally destructible and immaculately realised environment.                       A devastated future Earth becomes the battleground as a divided human race fights for survival against alien invaders.                      Through the game players control each of the games three factions - the Remnants Ascension and the alien Hai-Genti - each with unique identities strengths and tactics.                      Modify the terrain and use the elements as a strategic weapon. Create valleys carve out lakes freeze water melt ice create tornadoes and even control the wind.                      Characters grow experience and level up with new abilities as you progress through the game.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/11560/header.jpg", "genre": "Strategy"}, {"QueryName": "Hospital Tycoon", "ReleaseDate": 2009, "Metacritic": 3, "PriceFinal": 4.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": true, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Develop your own hospital drama and manipulate the results to your best advantage! In charge of a rapidly expanding hospital your job is to cure the patients with your army of doctors and nurses while successfully managing the facilities and taking care of everyones needs.                    Run the hospital and you influence the outcome in this funny highly accessible and involving game featuring character relationships staff management hilarious diseases and cures and more. Featuring gameplay thats as personable as you want it Hospital Tycoon has engaging locations missions and characters galore!                    Hospital Tycoon is easy to start impossible to put down. Its time to start operating!", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/11590/header.jpg", "genre": "Simulation"}, {"QueryName": "Lumines", "ReleaseDate": 2008, "Metacritic": 4, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": false, "GenreIsCasual": true, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Indulge in the fusion of puzzle light and music. Experience the addictive puzzle action enhanced with stylish graphics and block-rocking beats. Lumines introduces you to a brand new block-dropping-puzzler experience.  As you create 2x2 squares in same color the vertical time line wipes them away from left to right. Play to the music that is dynamically generated in synch with your gameplay. The award-winning puzzle music game is now available for play on your PC with just a simple mouse click!Numerous skins - Enjoy unlimited gameplay and unlock up to 21 stylish skins.Skin Edit Mode - Customize your Lumines experience by creating your own play list with your favorite skins.Time Attack Mode - Test your skills and see how many blocks you can erase in a given amount of time and compete with your own record.Puzzle / Mission Mode - Twist your brain to create certain shapes (dog heart number) using the blocks.Detailed play history - Take a look at your play style with detailed play history such as the number of erased blocks and more.Additional Skin Packs - Purchase additional Skin Packs to add more skins and Puzzle/Mission problems to play with.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/11900/header.jpg", "genre": "Casual"}, {"QueryName": "Grand Theft Auto III", "ReleaseDate": 2011, "Metacritic": 5, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": true, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": "Welcome to Liberty City. Where it all began.With stellar voice acting a darkly comic storyline a stunning soundtrack and revolutionary open-world gameplay Grand Theft Auto III is the game that defined the open world genre for a generation.", "DetailedDescrip": "The sprawling crime epic that changed open-world games forever.Welcome to Liberty City. Where it all began.The critically acclaimed blockbuster Grand Theft Auto III brings to life the dark and seedy underworld of Liberty City. With a massive and diverse open world a wild cast of characters from every walk of life and the freedom to explore at will Grand Theft Auto III puts the dark intriguing and ruthless world of crime at your fingertips.With stellar voice acting a darkly comic storyline a stunning soundtrack and revolutionary open-world gameplay Grand Theft Auto III is the game that defined the open world genre for a generation.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/12100/header.jpg", "genre": "Action"}, {"QueryName": "Grand Theft Auto: Vice City", "ReleaseDate": 2011, "Metacritic": 5, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": true, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": "Welcome to Vice City. Welcome to the 1980s. From the decade of big hair excess and pastel suits comes a story of one mans rise to the top of the criminal pile.", "DetailedDescrip": "Welcome to Vice City. Welcome to the 1980s.From the decade of big hair excess and pastel suits comes a story of one mans rise to the top of the criminal pile. Vice City a huge urban sprawl ranging from the beach to the swamps and the glitz to the ghetto was one of the most varied complete and alive digital cities ever created. Combining open-world gameplay with a character driven narrative you arrive in a town brimming with delights and degradation and given the opportunity to take it over as you choose.Having just made it back onto the streets of Liberty City after a long stretch in maximum security Tommy Vercetti is sent to Vice City by his old boss Sonny Forelli. They were understandably nervous about his re-appearance in Liberty City so a trip down south seemed like a good idea. But all does not go smoothly upon his arrival in the glamorous hedonistic metropolis of Vice City. Hes set up and is left with no money and no merchandise. Sonny wants his money back but the biker gangs Cuban gangsters and corrupt politicians stand in his way. Most of Vice City seems to want Tommy dead. His only answer is to fight back and take over the city himself.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/12110/header.jpg", "genre": "Action"}, {"QueryName": "Grand Theft Auto: San Andreas", "ReleaseDate": 2011, "Metacritic": 5, "PriceFinal": 14.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": true, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": "Five years ago Carl Johnson escaped from the pressures of life in Los Santos San Andreas... a city tearing itself apart with gang trouble drugs and corruption. Where filmstars and millionaires do their best to avoid the dealers and gangbangers. Now its the early 90s. Carls got to go home.", "DetailedDescrip": "Five years ago Carl Johnson escaped from the pressures of life in Los Santos San Andreas... a city tearing itself apart with gang trouble drugs and corruption. Where filmstars and millionaires do their best to avoid the dealers and gangbangers. Now its the early 90s. Carls got to go home. His mother has been murdered his family has fallen apart and his childhood friends are all heading towards disaster. On his return to the neighborhood a couple of corrupt cops frame him for homicide. CJ is forced on a journey that takes him across the entire state of San Andreas to save his family and to take control of the streets.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/12120/header.jpg", "genre": "Action"}, {"QueryName": "Manhunt", "ReleaseDate": 2008, "Metacritic": 4, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": "You awake to the sound of your own panicked breath. In Manhunt you must run hide and fight to survive. If you can stay alive long enough you may find out who did this to you. This is a brutal blood sport.", "DetailedDescrip": "They just killed Cash. Now they want to kill him again.  America is full of run down broken rust-belt towns where nobody cares and anything goes. In Carcer City nothing matters anymore and all thats left are cheap thrills. The ultimate rush is the power to grant life and take it away for sport. This time James Earl Cash you are the sport. They gave you your life back. Now they are going to hunt you down.  You awake to the sound of your own panicked breath. You must run hide and fight to survive. If you can stay alive long enough you may find out who did this to you.  This is a brutal blood sport.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/12130/header.jpg", "genre": "Action"}, {"QueryName": "Max Payne", "ReleaseDate": 2008, "Metacritic": 5, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": "Max Payne is a man with nothing to lose in the violent cold urban night. A fugitive undercover cop framed for murder hunted by cops and the mob Max is a man with his back against the wall fighting a battle he cannot hope to win.  Prepare for pain...", "DetailedDescrip": "Max Payne is a man with nothing to lose in the violent cold urban night. A fugitive undercover cop framed for murder hunted by cops and the mob Max is a man with his back against the wall fighting a battle he cannot hope to win. Max Payne is a relentless story-driven game about a man on the edge fighting to clear his name while struggling to uncover the truth about his slain family amongst a myriad of plot-twists and twisted thugs in the gritty bowels of New York during the centurys worst blizzard. The groundbreaking original cinematic action-shooter Max Payne introduced the concept of Bullet Time(r) in videogames. Through its stylish slow-motion gunplay combined with a dark and twisted story Max Payne redefined the action-shooter genre.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/12140/header.jpg", "genre": "Action"}, {"QueryName": "Max Payne 2: The Fall of Max Payne", "ReleaseDate": 2008, "Metacritic": 5, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": "Max Payne 2: The Fall of Max Payne is a violent film-noir love story. Dark tragic and intense the in-depth story is a thrill-ride of shocking twists and revelations. Love hurts.", "DetailedDescrip": "Max Payne 2: The Fall of Max Payne is a violent film-noir love story. Dark tragic and intense the in-depth story is a thrill-ride of shocking twists and revelations.  His life in ruins Max Payne finds himself back in the NYPD. During a routine murder investigation he runs into Mona Sax a woman he thought dead a femme fatale murder suspect. She holds the keys to the questions that haunt him. But nothing is simple in the dark and tragic night of New York City. An army of underworld thugs stands between Max and the answers he seeks. His journey deeper into his own personal hell continues. Max Payne 2: The Fall of Max Payne delivers an intense gameplay experience. It features fierce yet stylish action sequences and the slow-motion gunplay that has become synonymous with the Max Payne series.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/12150/header.jpg", "genre": "Action"}, {"QueryName": "Midnight Club II", "ReleaseDate": 2008, "Metacritic": 5, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": true, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": "The worlds most notorious drivers meet each night on the streets of LA Paris and Tokyo. Choose from a collection of performance-enhanced cars or bikes and compete head-to-head to make a name for yourself. There are no rules. Drive anywhere in the city. Find the fastest route to win.", "DetailedDescrip": "Members of the worlds most notorious illegal street racing syndicate meet each night on the streets of Los Angeles Paris and Tokyo. Find yourself in the position of a novice challenger set on penetrating this secret society and trumping them all one by one. Add insult to injury as you win the suped-up rides of defeated adversaries all on your way to being crowned international champion. Just remember there are no rules. Use whatever routes shortcuts and driving methods necessary to hit those checkpoints and arrive at the finish line before your opponent has a chance. The cops know you are out there - dont get caught.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/12160/header.jpg", "genre": "Racing"}, {"QueryName": "Bully: Scholarship Edition", "ReleaseDate": 2008, "Metacritic": 4, "PriceFinal": 14.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": true, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": "Bully tells the story of mischievous 15-year-old Jimmy Hopkins as he goes through the hilarity and awkwardness of adolescence. Beat the jocks at dodge ball play pranks on the preppies save the nerds kiss the girl and navigate the social hierarchy in the worst school around.", "DetailedDescrip": "Bully: Scholarship Edition takes place at the fictional New England boarding school Bullworth Academy and tells the story of mischievous 15-year-old Jimmy Hopkins as he goes through the hilarity and awkwardness of adolescence. Beat the jocks at dodge ball play pranks on the preppies save the nerds kiss the girl and ultimately navigate the social hierarchy in the worst school around.  Includes the complete soundtrack featuring 26 original tracks. After purchase and download you can locate the soundtrack in your Steam folder here: [Steam\\steamapps\\common\\bully scholarship edition\\Bully Original Soundtrack]. The Steam folder is typically found under C:\\Program Files\\Steam", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/12200/header.jpg", "genre": "Action,Adventure"}, {"QueryName": "Grand Theft Auto IV", "ReleaseDate": 2008, "Metacritic": 5, "PriceFinal": 19.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": true, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": "What does the American dream mean today? For Niko Bellic fresh off the boat from Europe it is the hope he can escape from his past. For his cousin Roman it is the vision that together they can find fortune in Liberty City gateway to the land of opportunity.", "DetailedDescrip": "What does the American dream mean today?                    For Niko Bellic fresh off the boat from Europe it is the hope he can escape from his past. For his cousin Roman it is the vision that together they can find fortune in Liberty City gateway to the land of opportunity. As they slip into debt and get dragged into a criminal underworld by a series of shysters thieves and sociopaths they discover that the reality is very different from the dream in a city that worships money and status and is heaven for those who have them and a living nightmare for those who dont.                    New high resolution technology brings Liberty City to life with even more stunning graphical detail                    Expanded multiplayer will require even more strategy and skill to come out on top                    Custom Match allows you to pick your favorite multiplayer options and then instantly find online matches that fit                                      Optimized for PC controls and Xbox 360 controller", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/12210/header.jpg", "genre": "Action,Adventure"}, {"QueryName": "Culpa Innata", "ReleaseDate": 2008, "Metacritic": 4, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": true, "GenreIsCasual": true, "GenreIsStrategy": false, "GenreIsRPG": true, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "The World Union is labeled the perfect society. Prosperity is a science disease and wars have vanished sex is entertainment and the future has never looked brighter. Suddenly this perfect society is rocked by the murder of a World Union citizen in the Rogue State of Russia. His murder oddly coincides with the accidental death of a prominent professor in Adrianopolis an important border town between the World Union and Russia. This career making case is assigned to a young woman Phoenix Wallis who as the Senior Peace and Security staff officer has been assigned to lead the murder investigation. Her search for the truth leads to enigmatic clues and deepening mysteries that challenge not only her case but her very belief in the world she has sworn to protect.This story-driven third-person game uses a 3D engine with dynamic cameras and other technologies developed by Momentum AS. Their remarkable patented facial animation technology is put to excellent use as the game features over fifty personable characters that youll frequently engage in dialogue throughout your investigation. Using the classic mouse in a point and click interface players have responded enthusiastically to the intuitive and responsive control. The game features a wide variety of organic obstacles ranging from logic puzzles to hi-tech gadget manipulation to dialogue and inventory challenges.Original complex story with a detailed history in a fully realized game world Environments and characters rendered in 3D with dynamic camera implementation Cinematics rendered with in-game engine for seamless graphics integration Click and go character control; user friendly mouse-driven interface Over 50 interactive characters each created with Momentum-patented 3D facial animation technology Intuitive dialogue system with player choice and branching conversation paths Non-linearity and optional player activities offer rewarding replay ability Character journal captures all key game moments More than 40 unique locations Diverse range of integrated challenges from standalone logic puzzles to hi-tech gadgetry to inventory and dialogue obstacles Original soundtrack", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/12310/header.jpg", "genre": "Adventure,Casual,RPG"}, {"QueryName": "Sacred Gold", "ReleaseDate": 2008, "Metacritic": 4, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": true, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "A shadow of evil has fallen on the kingdom of Ancaria. It is a time for champions - a time to journey into the perilous world of SACRED. Battle blood-thirsty orcs & lumbering ogres... Destroy undead wizards & rotting mummies... Slay hellish demons & legendary dragons. With blazing magic & sharpened steel prepare to embark on an epic quest of fantasy adventure & heroism. SACRED GOLD is the complete SACRED collection in one box containing the full version of SACRED winner of the Best Roleplaying Game 2004 award from PC GAMER Sacred Plus and Sacred Underworld.SACRED - The new name in Action-RPGs. SACRED delivers a huge elaborate world comprising 16 regions beset with heroic quests battle-hardened warriors and horrific enemies. Ancaria consists of highly detailed landscapes complete with villages and towns and also features a day/night cycle with varying weather systems. Regions vary from forests and mountains to deserts catacombs and ice-covered landmasses. More than three quarters of the world is open to the players from the very start - no unlocks needed.SACRED Plus - Incorporates all of the feedback from the player community since the first release of SACRED. This includes  an optimized interface and many completely new features: two new regions two additional main quests new item sets and weapons and many new creature types which make adventuring in Ancaria even more dangerous.SACRED  Underworld - Ancaria is facing a threat far greater than ever before. The now familiar world continues to evolve with existing SACRED players able to import their old characters into the Underworld.Choose from eight heroic characters: Gladiator Seraphim Battlemage Wood Elf Vampiress Daemon and Dwarf.Hundreds of unique weapons armors and set items - collect artifacts and forge all-powerful weapons!Learn Combat Arts develop new skills and customize devastating combo-attacks.A huge world open to explore from the outset.An epic RPG and enthralling storyline with over 30 main quests & 200 sub-quests and dynamic quests.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/12320/header.jpg", "genre": "Action,RPG"}, {"QueryName": "DarkStar One", "ReleaseDate": 2008, "Metacritic": 4, "PriceFinal": 7.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Darkstar One offers a fantastic amount of freedom of choice. The story-based missions gradually lead you deeper into the galaxy to new races new technologies and ever stronger opponents. Explore a vast array of solar systems in search of hidden artifacts of ancient races essential objects for upgrading your ship--the Darkstar One. In addition to artifacts acquire credits to purchase better equipment such as weapons and shields. Earn credits in a myriad of ways: by taking on assignments bounty hunting piracy smuggling trading escorting transporting rewards and more. A vast simulated universe with many unique races space ships and battle tactics.Elaborate story related by more than fifty minutes of video sequences.Configure and upgrade your ship Darkstar One any way you choose--build a fast attack ship with many light weapons or a near-invincible cruiser with heavy weaponry.Over two hundred different weapons shields and equipment items.Rockets torpedoes and mines feature special tactical uses: mines can fire at opponents or distract approaching missiles.The Spell Weapon: a special weapon with a powerful effect similar to certain spells in role-playing games. This weapon becomes increasingly versatile throughout the game and greatly increases tactical options.Acquire weapons from other races - Mount distinctive weapons from other races on Darkstar One each featuring unique functions that require different battle tactics.Embark on special missions - explore canyons or even underground on unknown worlds.Freedom of choice - earn credits in many ways: fighting piracy assignments smuggling trading escorting transporting rewards and more.Play as the good or the bad guy and take advantage of political disputes.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/12330/header.jpg", "genre": "Action"}, {"QueryName": "Jack Keane", "ReleaseDate": 2008, "Metacritic": 4, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": true, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Colonial England. Under a certain amount of duress... Jack takes on a job which will not only cause him a great deal of trouble but also bring to light the answer to a mystery out of his distant past. A lack of money leads Jack to accept a charter to take a British secret agent to mysterious Tooth Island. When Jacks ship shatters on the mysterious islands cliffs on arrival and the secret agent quickly becomes a meal for a monster in the jungle Jack is soon left to cope with the situation on his own.Tooth Island is ruled by the strange Doctor T who is cultivating man-eating plants and has his own dastardly plans for the British Empire. And why does he seem to know Jack who cant remember ever having been on Tooth Island? What are Doctor Ts plans? And what does he know about Jacks past? And then theres the young and naive Amanda who is filled by an almost fanatical drive to prove her worth. In the beginning the young lady is employed by Doctor T and part of her task is to track Jack down and take him prisoner. It doesnt take long before she begins to wonder if she is really on the right side or if she shouldnt join her opponent the charming Captain Jack instead.A hair-raising hunt across the length and breadth of the dangerous island finally airs the mystery surrounding Jacks past and leads to a spectacular showdown with a dark and deadly enemy and his nefarious henchmen.A wild action-packed Point-and-Click adventure A humorous and engaging story containing many allusions and references to famous movies characters and computer gamesGreat dialogue over 40 memorable characters Two playable characters  the somewhat clumsy daredevil Jack Keane and the attractive and adventurous Amanda A variety of settings including London the High Seas Capetown and of course Tooth Island! 3D levels presented in that classic adventure style Cinematic cut-scenes to push forward the captivating storyline", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/12340/header.jpg", "genre": "Adventure"}, {"QueryName": "FlatOut: Ultimate Carnage", "ReleaseDate": 2008, "Metacritic": 4, "PriceFinal": 19.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": true, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "FlatOut Ultimate Carnage lifts destruction racing to a whole new level of bone-breaking slaughter. FlatOut Ultimate Carnage is arcade destruction racing at its best and most extreme with real world physics three different game modes and offering players a wide variety of online and offline multiplayer options.                                        Features:                    Arcade destruction racing at its best: FlatOuts peerless real world physics engine combines vehicles built from 40 plus deformable parts with over 8000 destructible objects per track.                                         Huge number of race styles to suit your mood and preferences: Career racing. Compete in progressively tougher championship wrecking your way through 3 classes to become the ultimate FlatOut champion. Arcade racing. Deathmatch Destruction Derbies time trials and crash filled challenges.                                         Highly competitive FlatOut racing action: Compete against 11 other drivers in single player modes from a choice of 48 cars on 39 tracks in 6 different environments. Wreck you way across parched deserts massive storm drains and narrow city streets.                     Fully supports Games For Windows live: Up to 8 player simultaneous Live play including Races Derbies and Stunts plus the all-new Deathmatch Derbies and the excusive Head-On race mode.                                         Hilarious Ragdoll characters catapulted in-race and in 12 crunching mini games: The Ragdoll is a unique to FlatOut - which is catapulted through your windscreen or even better the other drivers windscreen as they are wrecked out of the race. Additionally there are the 12 Ragdoll events which take some beating for their sheer body abuse (e.g. High Jump Stone Skipping Ring of Fire Field Goal and Free Kick).                                         Cars look stunning: See every scratch and dent all with real-time environment mapping to create a grittier realistic appearance. flatout features dynamic shadow maps for every 3D object on the track including buildings scenery and cars making all movement in Ultimate Carnage exceptionally smooth. Improved particle effects e.g. Dust dirt smoke water splashes and bouncing sparks.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/12360/header.jpg", "genre": "Racing"}, {"QueryName": "Perimeter 2: New Earth", "ReleaseDate": 2009, "Metacritic": 3, "PriceFinal": 14.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": true, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Perimeter 2: New Earth is the long-awaited sequel of the critically acclaimed RTS Perimeter. Ideas of territorial gameplay and landscape modification introduced in the original game are now realized on a new concept & technology level. The Vista Game Engine enhances the dynamics and depth of gameplay turning the battlefield into an arena for the confrontation of two elements - ground and water.                    Story of Perimeter 2 continues the events from the original game. The Exodus lead by the wise Spirits has been searching for the New Earth. The Harkback have lost faith in Spirits overthrew their rule and decided to head back for the Old Earth not believing its death. They refused to believe in the death of their planet. Both sides took the final step on their way and mortal enemies entered the same planet face to face.                    Perimeter 2 is a project for fans of the RTS genre. The revolutionary concept of terraforming along with new elements and fresh ideas is sure to provide a unique gaming experience.                                        The concept of territorial warfare based on the conflict of water and ground and bringing gameplay to a new dimension.                    Transforming units assuring quick and effective reaction to the events on the battlefield and tactical diversity.                    Newly introduced Action-elements: players can enter the battle using the Providence - a Tactical Manipulator of Direct Action - and its super attacks such as huge explosions meteor showers and more.                    Newly introduced RPG-elements: players can dig the gaming maps in search of psy-crystals that are used to unlock and upgrade Providences super attacks. Apart from that psy-crystals hide important secrets about the past of New Earth.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/12420/header.jpg", "genre": "Strategy"}, {"QueryName": "Port Royale 2", "ReleaseDate": 2009, "Metacritic": 4, "PriceFinal": 4.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": true, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "The Caribbean in the 17th Century - Trade with over 60 towns create your own production facilities expand your trading empire and influence the development of the New World. As pirates and military fleets threaten your trade convoys youll need escort ships. Or you can turn the tides and hunt for pirates and capture the military ships yourself. Take on missions for merchants diplomats and other characters. By taking on the daring missions of the Vice Kings where you are to attack and conquer enemy towns you will be able to influence the defenses of your home towns directly. As a sign of gratitude you will be awarded land to be used later to build and oversee your own towns.Huge game world with 4 nations and 60 towns Construct production facilities houses and special function buildings to help your towns flourish Create your own towns Stronger consequences in wars (towns can be conquered) Introductory scenarios to describe all important features of the game 8 special scenarios for a quick and easy start into the Port Royale 2 world Open ended game with endless detail and game depth 16 different ship-types", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/12470/header.jpg", "genre": "Strategy"}, {"QueryName": "Puzzle Quest", "ReleaseDate": 2008, "Metacritic": 5, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": false, "GenreIsCasual": true, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "PuzzleQuest: Challenge of the Warlords delivers for the first time ever classic puzzle-game action backed with an epic story of good vs. evil.  Challenge your match 3 skills as you battle against computer opponents to save the Kingdom of Etheria from the evil Lord Bane.  Make matches of different crystal types which build your inventory of spells.  Outscore your oponents and unleash your spells to disrupt their matching chances and lower their totals.  Build your heroic character by winning head to head battles.  Or play classic match 3 in quick play mode.  Explore the expansive kingdom as you experience a puzzle game like nothing you have played before. Embark on an epic single-player campaign comprising more than 150 challenging quests.Jump into this exciting puzzle game and outmatch your opponent in Quick-play mode.Build your empire as you capture cities build castles and gain a party of companions that will aid you in battle.Earn money with each gold title to buy helms weapons armor and more!Experience tiles grant you additional experience instantly.Match skull tiles to inflict damage on other players.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/12500/header.jpg", "genre": "Casual"}, {"QueryName": "Legend: Hand of God", "ReleaseDate": 2009, "Metacritic": 3, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": true, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Become immersed in the fantastic world of Aris  a world populated by Orcs Elves Dwarfs and Humans. Complete more than 30 challenging quests to find the three parts of the Hand of God amulet and save Aris from impending doom. But beware of the more than 30 types of monsters and big bosses that are awaiting you as you fight your way through huge randomly-generated dungeons and detailed individually designed landscapes. But your hero will not be all alone. He will be accompanied by Luna a light elf  serving as companion campaign guide and mouse cursor at the same time.                    With Legend: Hand of God the German team Master Creating has created an epic Action RPG that raises the bar for the genre thanks to the involvement of well known industry veterans such as Paul Campion and Andreas Adamek.                    Explore a gigantic continuous world where you can seamlessly journey from the highest mountain to the deepest dungeon without a single loading screen.                    Cinematic combat system  combat in movie choreography quality but still as easy to control as in standard Action RPGs.                    Dynamic environment system e.g. fog rain snowstorms.                    Character creation that allows appearance and abilities shifting the latter by combining 2 out of 5 available skill trees.                    Strong storyline that will grab and hold you all the way till the end.                    A light elf that serves as companion mouse cursor light source and campaign guide at the same time.                    Stunning 3D graphics with an amazing level of detail and realism.                    Realistic physics based on the NovodeX technology which also powers the Unreal Engine 3.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/12630/header.jpg", "genre": "Action,RPG"}, {"QueryName": "Drakensang", "ReleaseDate": 2009, "Metacritic": 4, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": true, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Drakensang is a third-person party-based RPG based on the pen & paper role-play rules of The Dark Eye. Drakensang is the first PC game for over 10 years to be based on Germanys most successful and popular role-play system.                    Drakensang builds on the pen & paper rules as applied in version 4.0. The developers have optimized the rulebook specially for the PC realization in order to make the game more accessible. But the essential qualities and the depth of the original rules have not been compromised.                    Intensive tactical combat and intriguing quests embedded in a wonderfully detailed 3D graphic presentation  these are the cornerstones of the fantasy epic.                    Experience an exciting story within a huge campaign involving numerous main and side quests                    Adventure groups with up to four adventurers                    Expert character-creation mode for experienced DSA fans                    More than 40 spells with over 30 talents and almost 40 special abilities allow a large range of possibilities for character creation                    Numerous and varied enemies and monsters from the DSA universe such as linnorms ogres undead mules giant amoeba and many more                    Story by original DSA authors                    Rule-compliant implementation of the DSA licence in the tradition of the Nordland Trilogy                    Tactical combat system with pause function                    Varied and flexible magic system                    Talent-based dialogue system", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/12640/header.jpg", "genre": "RPG"}, {"QueryName": "GRID", "ReleaseDate": 2008, "Metacritic": 5, "PriceFinal": 14.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": true, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Discover a stunning world of motor sport brought to life from racing muscle cars through the iconic streets of San Francisco and competing in the legendary 24 hours of Le Mans to drifting around the docks of Yokohama. Jump behind the wheel of exhilarating racing cars in the most aggressive spectacular wheel-to-wheel races youve ever experienced.Incredible persistent world of racing encompassing Muscle car racing Drift racing and Circuit racing in Detroit San Francisco Milan Tokyo Yokohama Spa Le Mans and many moreMind-blowing soft-body damage to vehicles and environments to the most aspirational and incredible vehicles and tracks  all fully licensedStunning visual treatment and accessible handling systemEvolution of the physics system used in Colin McRae(tm) DiRT(tm)  EGO surpasses all previous engines in terms of AI effects and packed grids", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/12750/header.jpg", "genre": "Racing"}, {"QueryName": "Rise of the Argonauts", "ReleaseDate": 2009, "Metacritic": 3, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": true, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "As the King of Iolcus Jason had everythinga prosperous kingdom the respect of his peers and a beautiful fiance.  When she was killed on their wedding day he vowed to do anything to restore her life.  Now in order to accomplish this heroic feat Jason must seek out the Golden Fleece -- and with the help of Greek mythologys greatest heroes -- set sail on the most epic voyage of all.                    A grand scale Action/RPG Rise of the Argonauts(tm) immerses players in a gladiatorial adventure set in the vibrant and powerful world of Ancient Greece brought to life.  Taking the role of Jason players will battle alongside Hercules Achilles and other Argonauts as they engage in brutal combat against formidable beasts and enemies in a vast world alive with wondrous inhabitants and stunning panoramas.  The search for the Golden Fleece is not only one of exploration but of transformation -- from warrior king to exalted hero touched by the gods.                    Immerse yourself in gameplay through a redefined RPG experience that streamlines character and resource management. Spend more time playing and less time micro-managing inventory and resources through a streamlined HUD and inventory system.                    Unleash devastating attacks in real time with lethal combinations of weapons powers granted by the gods and the battle tested loyalty of your Argonauts. Assemble the most effective team of Argonauts for each mission to put the best battle plan forward.                    Explore the vibrant and powerful world of ancient mythological Greece brought to life. Experience a living breathing and vivid ancient world taking you far beyond the broken statues and ruins that so often define the myth.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/12770/header.jpg", "genre": "RPG"}, {"QueryName": "Damnation", "ReleaseDate": 2009, "Metacritic": 3, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": true, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Evolving the shooter genre with its unique and exhilarating combination of fluid action and combat Damnation features huge open environments frenetic combat daredevil acrobatics and high-octane vehicle-based stunts. Presenting players with an intense test of reflexes quick thinking and rapid-fire conflict Damnation will feature vast breathtaking landscapes each covering miles of distance and thousands of vertical feet.                    Billed as a shooter gone vertical and visually inspired by iconic elements of American history these massive streaming landscapes will form the battlegrounds for a post-industrial conflict between humanity and an unstoppable arms dealer hell-bent on total world domination.                    Choose your own paths and navigate the world by performing daredevil feats on the edge of human ability                    Intelligent enemies will give chase and engage players in frantic gun fights and attacks that can come from any direction                    Miles of awe-inspiring landscapes and up to three hours of actual gameplay per level                    A full-range of unique vehicles from wall-riding motorbikes to armour piercing mobile artillery provide high-octane thrills                    Extensive multiplayer options including drop-in-drop-out co-op", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/12790/header.jpg", "genre": "Action,Adventure"}, {"QueryName": "Overlord II", "ReleaseDate": 2009, "Metacritic": 4, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": true, "PlatformMac": true, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": true, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Overlord II sequel to the critically acclaimed cult hit sees the return of the chaotic Minions and their new Dark Master. Bigger badder and more beautifully destructive Overlord 2 has a Glorious Empire to smash a massive Netherworld to revive Minion mounts to mobilize a trio of mistresses to woo War Machines to crush opposition and lots of cute creatures to err... murder (and a mini-map)                    What sort of stuff will I get to kill? Your main source of victims will come from the brave and highly flammable ranks of the Glorious Empire a sinister regime that gained power after the fall of the previous Overlord. Youll be hacking your way through entire battalions at a time but to keep the blood on your sword varied weve also thrown a few Yetis Elves villagers and annoyingly cute indigenous species into the mix just to name but a few. Dont say we never do anything for you.                    Ive always wanted to enslave the human race is this the game for me? Youve come to the right place! With the Domination style Overlord humanity can become your plaything. Village by village youll reap the benefits of an unwilling workforce as you drive the Glorious Empire from your lands.                    Im more of a watch the world burn kind of guy can I still get my rocks off? Weve got your pleasure sir. With the Destruction style Overlord you can ravage the land like a moody Tsunami; razing cities forests and Imperial camps to the ground just because they looked at you funny.                    What can my minions do? Minions are angry little Swiss army knives of pain: They can ride into battle on wolves and other magical creatures loot the best weapons from stomped enemies pillage houses for treasure operate fearsome war machines infiltrate enemy camps and polish your armour so thoroughly youll blind passing wildlife.                    What types of Minions can I rule? This new batch of minions is smarter faster deadlier and wittier than the sorry sacks of skin you used to rule. Minions now come in four fantastic flavours: Browns are brutal brawlers that solve their problems with teeth and fists. Reds are the surly artillery who love to play catch as long as its with fireballs. Greens are the stealthy assassins. Silent and deadly like a fart on legs. Blues are no use in a fight but can resurrect fellow Minions whove tried to stop a sword with their face.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/12810/header.jpg", "genre": "RPG"}, {"QueryName": "Operation Flashpoint: Dragon Rising", "ReleaseDate": 2009, "Metacritic": 4, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": "Operation Flashpoint: Dragon Rising is a game about a fictitious conflict on one of the Sakhalin islands.", "DetailedDescrip": "Operation Flashpoint: Dragon Rising is a game about a fictitious conflict on one of the Sakhalin islands a conflict that is in danger of erupting onto a global scale. The player takes the role of a US soldier part of the allied force fighting against outnumbering Chinese forces vying for control of the island.The game centers on a campaign narrative that gives the player a variety of roles in the allied forces ranging from a Marine Infantry tank commander Special Forces and helicopter captain. The game has an incredible realistic depiction of war with careful attention to the detail of the weapons equipment and tactics of the armed forces. The action is varied from intense fire fights through to slower pace tactical decision making on how to best tackle the mission objectives.Most accessible engaging and visceral sandbox shooter - Includes over 100 authentically modeled vehicles and weapons and players will be able to control multi-component vehicles including tanks infantry fighting vehicles APCs attack and utility helicoptersFreedom of Play - Players will need to balance brute force with intelligent use of tactics with unscripted missions containing real objectives such as covering a friendly units retreat or conducting short-range recon patrols", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/12830/header.jpg", "genre": "Action"}, {"QueryName": "Audiosurf", "ReleaseDate": 2008, "Metacritic": 5, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": true, "GenreIsAction": false, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Steam Big PictureAbout the GameRide your music.Audiosurf is a music-adapting puzzle racer where you use your own music to create your own experience. The shape the speed and the mood of each ride is determined by the song you choose. You earn points for clustering together blocks of the same color on the highway and compete with others on the internet for the high score on your favorite songs. Audiosurf on Steam includes The Orange Box soundtrack integrated with the game to enable Still Alive surfing and more. In addition Audiosurf is one of the first titles to leverage Steamworks offering full support for the Steam Achievements that appear on Steam Community profile pages.Play with any music from your own collection--the game supports MP3s iTunes M4As WMAs CDs and OGGs Valves The Orange Box Original Soundtrack is included.Online scoreboards for each song you play.Choose your strategy from 14 available characters.Track your progress as Steam Achievements.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/12900/header.jpg", "genre": "Indie"}, {"QueryName": "Ninja Reflex: Steamworks Edition", "ReleaseDate": 2008, "Metacritic": 3, "PriceFinal": 4.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": true, "GenreIsAction": false, "GenreIsAdventure": false, "GenreIsCasual": true, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Master the Art of Speed and become a Ninja Gamer!  Ninja Reflex uses martial arts challenges to test your reflexes sharpen your hand-eye coordination and measure your reaction times to the millisecond.  Wield throwing stars katanas nunchucks...even chopsticks!  Progress from White Belt all the way to Black Belt 3rd Degree and see if you can complete the 50+ Steam achievements on your journey!300 Ninja challenges to conquer.Go from White Belt to Black Belt 3rd Degree.50+ Steam achievements to complete.Compete in local multiplayer battles with up to 4 players.Receive authentic martial arts wisdom from your Sensei.Create a Ninja Name from over 25000 possibilities.Learn to Meditate to achieve greater mental focus.Find all the Half-Life and Portal Easter Eggs!", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/13000/header.jpg", "genre": "Indie,Casual"}, {"QueryName": "America's Army 3", "ReleaseDate": 2009, "Metacritic": 4, "PriceFinal": 0.0, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": "Download AA3 Today and Become a Member of the elite Americas Army Team! Americas Army fans and new players alike can now experience Americas Army 3 the official U.S. Army game.", "DetailedDescrip": "Check Out the latest installment Americas Army: Proving GroundsDownload AA3 Today and Become a Member of the elite Americas Army Team!  Americas Army fans and new players alike can now experience Americas Army 3 the official U.S. Army game which has more authentic military elements including training technology weapons and audio than any other military game.  Built on Unreal Engine 3 AA3 delivers stunningly realistic characters environments lighting effects animations and team-based experiences. In the game where Every Detail Counts(tm) players are bound by Rules of Engagement (ROE) and gain experience as you navigate challenges in team-based multiplayer force-on-force operations. With 15 different map/mission combinations and exclusive advanced training that allows you to unlock new abilities and customize your gear youll experience Soldiering in the U.S. Army like never before.   Find strength like no other in a game like no other. Start your mission now! When you play AA3 on Steam youll earn Steam Achievements ranking up among your friends as you earn distinguished status badges medals and ribbons. With AA3 on Steam you can also save your keyboard bindings to the Steam Cloud - just login to your Steam account and fire up AA3 on any PC to utilize your custom settings.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/13140/header.jpg", "genre": "Action"}, {"QueryName": "Unreal II: The Awakening", "ReleaseDate": 2008, "Metacritic": 4, "PriceFinal": 14.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "You are John Dalton an ex-Marine assigned to patrol the edge of human space as a Marshal for the Terran Colonial Authority. Unexpectedly your monotonous life is shattered by a chilling distress signal plunging you into an adventure beyond belief. Violent turmoil among the races has erupted on your watch. Thrust into a conflict that will determine the fate of the galaxy you are humanitys only hope for salvation. Only you can prevent the Awakening.Not Your Average Mission - Command a team of marines defending a ravaged base. Infiltrate an enemy stronghold. Rescue the trapped survivor of an alien raid. With a demanding array of objectives you have one overriding goal - survival. Be ready for anything. Unreal Graphics and Sound - Awe-inspiring graphics immerse you in a swarm of alien worlds full of breathtaking scenery and brutal action. 3D sound envelops you in hailstorms of bullets mind-jarring explosions and the eerie chatter of alien tongues.From Your Mind to the Game - Use the included Unreal Editor software to create your own levels of Unreal play. Design your own game mods and challenge others to enter your personal Unreal Universe.© 2003 Epic Games Inc. All rights reserved. Epic Epic Games Unreal and Unreal II are trademarks or registered trademarks of Epic Games Inc. in the United States of America and elsewhere.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/13200/header.jpg", "genre": "Action"}, {"QueryName": "Unreal Tournament 3: Black Edition", "ReleaseDate": 2009, "Metacritic": 5, "PriceFinal": 19.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Just Updated: Community Bonus Pack - Volume 5!Click here to learn more about the CBP3 update!About the GameNow includes the free Titan Pack expansion!                    The Titan Pack gives players a substantial amount of enhanced features and new content including many original environments new gametypes the namesake Titan mutator powerful deployables and weapons new characters and the Stealthbender vehicle.                     Also included are sweeping enhancements to AI networking performance UI usability and mod support plus the addition of 57 Steam Achievements to make the UT3 experience even more satisfying. The Titan Pack also brings client-side demo recording major Server Browser enhancements a new maplist system plus mid-game mutator and gametype voting functionality to the PC.Titan Pack includes:                    16 environments  four Warfare three vCTF six Deathmatch and three CTF maps  that are new to the PC and PS3 versions                    Three bonus pack maps CTF-Face CTF-Searchlight and DM-Morbias                    The namesake Titan mutator which lets players overwhelm opponents as a 15 foot tall titan or crush them as a 30 foot tall Behemoth                    Greed and Betrayal two gametypes that breed new-found fervor throughout the competitive UT3 arena                    Two powerful weapons the Stinger Turret and Eradicator Cannon artillery                    Two valuable deployables the X-Ray Field and Link Station                     The Slow Field power-up a portable version of the Slow Field deployable                    Stealthbender a new vehicle that carries two spidermine trap deployables one EMP mine and one each of the new Link Station and X-Ray Field deployables                    Two new characters Nova and Kana                    57 awards attainable as Steam Achievements                    Significant AI enhancements especially in vehicle gametypes; networking performance upgrades; greatly improved menu flow and UI usability; better mod support                    Client-side demo recording highly improved Server Browser a new maplist system plus mid-game mutator and gametype voting functionality for PC                     About Unreal Tournament 3Unreal Tournament 3 marks the return of the worlds premiere first-person shooter. Unreal Tournament 3 unleashes the full power of Unreal Engine 3 taking graphics gameplay and challenge to a whole new level. Players engage in intense battles with other human players online or against Unreal artificial intelligence that sets the industry standard. With the most powerful futuristic weapons and vehicles available this is FPS action at its best! Unparalleled graphical and physical realism from the award-winning Unreal Engine 3 technology delivers the most compelling first-person shooter experience to date...online and offline!Vast arsenal of weapons - Unreal Tournament has always been known for brutal weaponry and now the arsenal is even bigger and badder. Detonate your opponent from a distance with the ever popular Shock Rifle or blast away at close range with the Flak Cannon. Over two dozen weapons and vehicles have been upgraded and enhanced for maximum killing potential.New single player campaign! This is Unreal Tournament like youve never seen it before! The Necris invasion has begun and your clan was one of the first to be slaughtered. Head to the front lines and join this Epic battle to defend humanity while taking your revenge.New and favorite characters - Fight side-by-side with or compete against new and returning characters from the Unreal universe all with enhanced abilities extremely detailed designs and distinct personalities.Enhanced popular game types including Deathmatch Team Deathmatch Capture the Flag and all-new Warfare mode and more.Online innovations - Unreal Tournament 3 brings back all the award-winning online features of previous Unreal Tournament games plus seamless loading on servers improved matchmaking and co-operative campaign play online.PC version bundled with the award-winning Unreal Engine 3 Toolset - Build your own levels game types and more or download the latest mods from the massive Unreal community.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/13210/header.jpg", "genre": "Action"}, {"QueryName": "Unreal Tournament 2004", "ReleaseDate": 2004, "Metacritic": 5, "PriceFinal": 14.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Unreal Tournament 2004 is a multiplayer first person shooter that combines the kill-or-be-killed experience of gladiatorial combat with cutting-edge technology. Ten game modes - both team-based and every man for himself -- provide even the most hardcore gamer with palm-sweating challenges through unbelievably detailed indoor arenas and vast outdoor environments. As the ultimate techno-gladiator of the future players will take their fates into their hands battling against up to 32 other players online in action-packed frag-filled arenas.Assault Mode - Assault mode returns! Redesigned for UT2004 this fan-favorite mode sees teams face-off to defend and attack fortified bases from fast-moving trains barreling across an arid alien desert to a Skaarj mother ship poised to attack the human home world. Onslaught Mode - Onslaught mode takes team combat to the next level! Opposing teams are pitted against each other to capture and hold strategic points in order to attack and destroy the enemy power core. Taking place in massive outdoor environments here is where vehicular combat comes into its own. Flying and driving machines take combatants to the frontline and gigantic mobile battle stations serve as a platform from which to launch devastating attacks. Vehicles - Rev-up and ride out in an array of land- air- and space-based vehicles that play critical roles in a successful combat strategy in Assault and Onslaught. With vehicles ranging from single man fighters to five man behemoths Unreal Tournament 2004 provides players with plenty of choices when shopping for a mechanized implement of destruction. Levels - More than 95 maps will be available immediately including more than 45 brand new maps for all existing game play modes as well as new modes of play. Vast outdoor environments deep space combat areas and tightly packed indoor techno-arenas are all waiting for the latest entrants to the Tournament. Weapons - The entire smorgasbord of frag-dealing weaponry from Unreal Tournament 2003 returns for the experienced player to wield masterfully against new contestants. Those armaments are joined by three new implements of doom: the Mine layer which disperses spider-like bombs that chase and harass any enemy that comes within range; the anti vehicle rocket launcher or AVRiL which deals out a payload of massive rockets tuned to seek and destroy enemy mechanized units; the Grenade Launcher which launches timed explosives that will bounce on the ground and stick to enemies and enemy vehicles only to be triggered by the weapons altfire command; and the return of the notorious Sniper Rifle from the original Unreal tournament completely redesigned and upgraded to make heads roll. New Characters - Unreal Tournament 2004 introduces 32 new characters on four new teams: The human Thunder Crash lead by Tournament hero Malcolm; the Robotic Corrupt lead by an upgraded Xan Kriegor; the Iron Skull a team of merciless Skaarj warriors; and the Hellions -- wreckless human mercenaries and pirates who delight in the thrill of the kill. New Technology - Unreal Tournament not only brings new content for hardcore fans to relish it also delivers a tremendous technology update over its predecessor delivering a faster slicker deeper experience than ever before.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/13230/header.jpg", "genre": "Action"}, {"QueryName": "Unreal Tournament: Game of the Year Edition", "ReleaseDate": 2008, "Metacritic": 5, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Unreal Tournament is the original King of the Hill in the frag-or-be-fragged multiplayer gaming world. As the undisputed 1999 Game of the Year Unreal Tournament grabbed the first person shooter genre by the soiled seat of its pants and knocked it around the room with its never-before-seen graphics brutal edge-of-your-seat gameplay and a massive and varied feature list that gave gamers more than they ever expected.Novice Mode - This Botmatch competition is where new flak fodder hit boot camp. The Novice setting makes the computer controlled Bots in the game move slower and inflict less damage with their attacks. For those new to first person shooters this is where teeth are cut skills are born and addiction begins... Hardcore Mode - Strap on extra armor and have a hand towel next to your mouse pad to wipe away the palm sweat. This mode is only for the pros -- all of the bots move like lightning -- dodging jumping and inflicting A LOT more damage with their standard attacks than do their Novice counterparts. Enhanced Bot AI - Bots in Unreal Tournament play as if theyre jacked up on a big old shot of steroids. Their basic deathmatching skills have been virtually perfected their understanding of the game rules is professorial their ability to navigate levels is GPS-like and their threat to your existence is very real. Radio Chatter - Each of the commands at your disposal in the game is accompanied by both a text message on screen AND an audio message. Pleas for back-up or for cover fire are accompanied by pre-recorded sequences communicating your needs. Making this especially cool is the fact that you can hear your opponents messages too (even if youre playing against bots cause bots are people too). New Command Line Options - For the hardcore server masters this is the dream way to access features and manage a game. Virtually any option you want to tweak can be accessed via the UT command line. Nice and easy! Improved User Interface - Unreal Tournament introduced a better way to see what is happening during a game. By using a unique heads up display (HUD) for each game type (Deathmatch Capture the Flag Domination and Assault) the game provides ALL the info needed to play effectively WITHOUT bombarding the player with excessive info. UBrowser - Unreal Tournaments robust Ubrowser system provides the easiest way to find a game on the Internet and jump into battle. The Ubrowser eliminates the need to download third-party server querying applications. Its as simple as one-two-frag. By clicking on the Play Online button and then selecting a server from the list the game is on. Spectator Cams - Watching a game of Unreal Tournament has the potential to be almost as much fun as playing it. Thanks to the Spectator Cams gamers can enter a game and hop around to designated Spectator Cams to view the action on the level. Even cooler the camera can be attached to one of the players in the level to view the action from their perspective. Either way its a cool feature and a great way to learn for people new to the world of online gaming. Jump Mode - Jump twice as high as normal. Its sorta like having a never-ending pair of jumpboots on. The impact these boots have on gameplay is almost indescribable. It changes the dynamic completely.(c) 2000 Epic Games Inc. All rights reserved. Epic Epic Games Unreal and Unreal Tournament and Unreal (Stylized) are trademarks or registered trademarks of Epic Games Inc. in the United States of America and elsewhere.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/13240/header.jpg", "genre": "Action"}, {"QueryName": "Prince of Persia: Warrior Within", "ReleaseDate": 2008, "Metacritic": 5, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": true, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Enter the dark underworld of Prince of Persia Warrior Within the sword-slashing sequel to the critically acclaimed Prince of Persia: The Sands of Time™.Hunted by Dahaka an immortal incarnation of Fate seeking divine retribution the Prince embarks upon a path of both carnage and mystery to defy his preordained death. His journey leads to the infernal core of a cursed island stronghold harbouring mankinds greatest fears.Only through grim resolve bitter defiance and the mastery of deadly new combat arts can the Prince rise to a new level of warriorship and defend what no enemy shall take away - his life.Define your own combat style with the Free-Form Fighting System - An intricate new combat system lets you wage battles with no boundaries. Utilize the environment weapons and your enemies themselves to develop your own unique fighting style. Plus a strategic projectile attack system allows for a variety of ranged combat tactics. Endure the epic - Hours upon hours of action await in your fight for survival including multiple endings and over 50 weapons to find and master. Change the past to affect the present - Travel back in time to prevent the creation of your deadly fate - your every action will affect the history of the present including environments stories inhabitants and more. Control the ravages of time - Ravage enemies with the devastating new combative powers of time manipulation opening up astounding variations in fighting gameplay as you rewind fast-forward and slow time down. Explore a violent underworld - Explore and conquer a cursed island underworld a breeding ground for the most brutal unrelenting enemies to torment mankind. Confront a deadly seductive evil - Survive the evils of the Empress a stunning villainess with the power to bend the minds of men. This dark siren of the underworld holds legions of monsters under her command.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/13500/header.jpg", "genre": "Action,Adventure"}, {"QueryName": "Far Cry", "ReleaseDate": 2008, "Metacritic": 5, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "A tropical paradise seethes with hidden evil in Far Cry(r) a cunningly detailed action shooter that pushes the boundaries of combat to shocking new levels.Freelance mariner Jack Carver is cursing the day he ever came to this island. A week ago a brash female reporter named Valerie had offered him an incredible sum of cash to take her to this unspoiled paradise. Shortly after docking however Jacks boat was greeted by artillery fire from a mysterious militia group swarming about the island.With his boat destroyed his money gone and the gorgeous Valerie suddenly missing Jack now finds himself facing an army of mercenaries amidst the wilds of the island with nothing but a gun and his wits to survive. But the further he pushes into the lush jungle canopy the stranger things become.Jack encounters an insider within the militia group who reveals the horrific details of the mercenaries true intentions. He presents Jack with an unsettling choice: battle the deadliest mercenaries or condemn the human race to a maniacs insidious agenda.Feel the Far Cry engine - The meticulously designed next-generation Far Cry engine pushes the threshold of action gaming with proprietary Polybump mapping advanced environment and character physics destructible terrain dynamic lighting motion-captured animation and total surround sound. Unparalleled long-range gunplay - Battle to the ends of the earth with Far Crys utterly unique 800-meter scalable view system. Lock onto enemies from a distance with motion-sensing binoculars. Then choose your style of attack - from long-range sniping to ballistic close-quarters firefights - and everything in between.Cunning and complex AI tactics - Battles never become repetitive when you face Far Crys unpredictable intelligent AI mercenary units trained in advanced adaptive group tactics. Units include snipers stalkers scouts and grenadiers who engage you from all angles distances and terrains in coordinated strikes. Commanders will even call for reinforcements by land sea or air.Diverse combat action - Master a dynamic slate of combat skills - close-quarters combat long-range shooting search-and-destroy tactics stealth operations and combat driving skills through indoor and outdoor environments.Heart-pounding atmosphere - Experience unprecedented drama and realism in a misleadingly perfect setting with incredible lighting and shadows adaptive audio and weather effects.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/13520/header.jpg", "genre": "Action"}, {"QueryName": "Prince of Persia: The Two Thrones", "ReleaseDate": 2008, "Metacritic": 5, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": true, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "The Prince of Persia a seasoned warrior returns from the Island of Time to Babylon with his love Kaileena. Instead of the peace that he longs for he finds his homeland ravaged by war and the kingdom turned against him. The Prince is rapidly captured and Kaileena has no choice but to sacrifice herself and unleash the Sands of Time in order to save him. Now cast out on the streets and hunted as a fugitive the Prince soon discovers that past battles have given rise to a deadly Dark Prince whose spirit gradually possesses him...Play and master two distinct characters - Wield the powers and weapons of two master warriors with different combat styles attitudes and histories.Choose your way to kill - Master the expanded Free-Form Fighting system to destroy enemies in your own style; strangle enemies from afar with the deadly Daggertail; or use a new stealth art to inflict surprise decapitations - the choice is yours.Battle freely through Babylon - Dominate enemies on the perilous rooftops dodge through chaotic streets and ambush pursuers in dark underground passageways.Immerse yourself in a dramatic story - Experience unparalleled depth in storytelling as you fight your way through a twisting tale filled with adrenaline tension and discovery.Manipulate time to surprise enemies - Execute powerful attacks against entire armies by slowing down or rewinding time or surprise them by using some all-new Sands of Time powers.Experience a masterful blend of gameplay - True to the Prince of Persia franchise the game provides a variety of action combat agility and story-driven puzzles - all masterfully blended together into a rich gaming experience.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/13530/header.jpg", "genre": "Action,Adventure"}, {"QueryName": "Tom Clancy's Rainbow Six: Vegas", "ReleaseDate": 2008, "Metacritic": 5, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Tom Clancys Rainbow Six makes its next-generation hardware debut in the most dramatic installment of the renowned first-person shooter franchise to date.Rainbow operatives take to the chaotic streets of Las Vegas as an escalating terrorist siege in Sin City threatens to take world terrorism to new uncontrollable heights. The future of global security hangs in the balance as you battle to defend classic Vegas locations and environments like Fremont Street the Strip and casinos. Experience Las Vegas like never before - through revolutionary next- generation technology as you work against the clock to keep one of the worlds most recognizable cities from utter devastation. New Leader New Team - Team Rainbow ushers in a new breed of heroes. With a new team comes added responsibility. Tactics play a MAJOR role in your teams success as each member comes equipped with his own skill set: Logan Keller team leader and recon expert; Michael Walter heavy weapons and demolition expert; and Jung Park long range and electronics specialist. Special Order Location - Experience a new level of squad-based realism as your teammates Michael and Jung offer you real-time tactical suggestions like busting through walls or hacking computers all in a race against time to locate the heart of the terrorist cell. Observe - Plan - Assault - Use tactical planning to maneuver through multiple-path Vegas environments while utilizing high-tech equipment such as snake cams to strategically tag terrorist targets to your teammates prior to entering a room. Real-Time Immersion - Prepare yourself for a new level of in-game immersion with real-time mission briefings all in the midst of the most intense combat ever played.Advanced Gameplay Animations - Motion-captured assault and recon techniques such as fast roping rappelling window entry blind-cover fire and more. All captured by an experienced Hollywood animation expert.Next-Generation Artificial Intelligence - Next-generation technology brings a higher level of artificial intelligence to Rainbow Six. As you get past the grunts and advance closer to the center of the terrorist cell encounter deadlier more skilled enemies who work together as a group to counter every move you make. Customizable Multiplayer Experience  - Create your own multiplayer character that evolves as you play online unlocking new equipment and achievements as you go.Ubisoft Montreal Returns - Rainbow Six is back in the hands of Ubisofts Montreal studio creators of the award-winning and highly acclaimed Rainbow Six 3.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/13540/header.jpg", "genre": "Action"}, {"QueryName": "Tom Clancy's Splinter Cell", "ReleaseDate": 2008, "Metacritic": 5, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Infiltrate terrorists positions acquire critical intelligence by any means necessary execute with extreme prejudice and exit without a trace!You are Sam Fisher a highly trained secret operative of the NSAs secret arm: Third Echelon. The world balance is in your hands as cyber terrorism and international tensions are about to explode into WWIII.Go Behind the Headlines into the Real World of Modern Espionage - Enter the realistic Tom Clancy universe. Suit up with the latest classified field operative gear and weapons. A New Level of Stealth Action - All the best stealth action plus all new moves. Highly interactive environments giving players more gameplay options and the ability to strategize their actions. Deep Environments. Unparalleled Immersion - Stunning environments driven by the Unreal(tm) engine. Dynamic lighting and sound effects that match reality. Pulse-Pounding Action on a Global Scale - Over 20 Hours of stealth action. Diverse mission objectives that can be achieved by different means for increased replay value.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/13560/header.jpg", "genre": "Action"}, {"QueryName": "Tom Clancy's Splinter Cell: Chaos Theory", "ReleaseDate": 2009, "Metacritic": 5, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "The year is 2008.Citywide blackouts ... stock exchange sabotage ... electronic hijacking of national defense systems ... this is information warfare.To prevent these attacks operatives must infiltrate deep into hostile territory and aggressively collect critical intelligence closer than ever to enemy soldiers.You are Sam Fisher the NSAs most elite black-ops agent. To achieve your mission you will kill from close range attack with your combat knife shoot with the prototype Land Warrior rifle and use radical suppression techniques such as the inverted neck break. Also take on cooperative multiplayer infiltration missions where teamwork is the ultimate weapon.As the enemy evolves so must you.Deadly agility - Incredibly complete and fluid variety of moves including athletic moves stealth moves stealth kills.Real weapons of tomorrow - The most complete arsenal of weapons and gadgets from the knife to the experimental Land Warrior System.As good as real - Never-before-seen graphics technology offers the best visuals on any system yet. Advanced physics engine allowing rag doll physics particle effects and perfect interaction with the environment.Ultimate challenge - Intelligent AI with personal attributes natural behavior where NPCs are aware of thier environments and remember past events.Amazing replayability - Totally open level design with multipaths and optional secondary objectives.Co-op stealth - Play multiplayer with friends and coordinate your infiltration in an all-new multiplayer challenge.Please note that as of August 2016 the online features for this game are no longer supported.  The Multiplayer mode / Co-op mode will no longer be accessible.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/13570/header.jpg", "genre": "Action"}, {"QueryName": "Tom Clancy's Splinter Cell: Double Agent", "ReleaseDate": 2009, "Metacritic": 5, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "The best-selling Tom Clancys Splinter Cell® saga takes on an entirely new direction.In the highly anticipated sequel to the 2005 game of the year Tom Clancys Splinter Cell Double Agent™ play as a double agent spy for the first time ever. Take on dual roles of covert operative and ruthless terrorist where your choices of whom to betray and whom to protect actually affect the outcome of your game.Experience the relentless tension and gut-wrenching dilemmas of life as a double agent.  Lie. Kill. Sabotage. Betray. All to protect the innocent. How far will you go to gain the enemys trust? As covert operative Sam Fisher you must infiltrate a vicious terrorist group and destroy it from within. Youll need to carefully weigh the consequences of your actions. Kill too many terrorists and youll blow your cover. Hesitate and millions will die. Do whatever it takes to complete your mission but get out alive. Double agent gameplay and branching storyline - Play both sides and decide between opposing NSA and terrorists objectives. You choose whos priorities to support and whos to undermine. Your actions affect the story and gameplay leading to shockingly different endings.Upgradeable weapons and gadgets - As you progress get access to upgraded prototype gadgets and weapons like improved night vision based on your choices and covert skills. Authentic double agent tactics - Use realistic tactics based on testimonies of actual undercover agents to sabotage the enemies plans. Dont blow your cover - Steal destroy kill and evade the authorities. Do whatever it takes to make your mark and gain the terrorists trust.A world of International espionage - Go from Shanghai and Cozumel to America itself where New York City and Los Angeles are threatened by the terrorists agenda of destruction. All-new extreme gameplay situations - Conduct your missions underwater amidst churning ice floes in a blinding sandstorm or even sheathed in dust and smoke.Innovative multiplayer - The critically acclaimed multiplayer modes are back with new innovations and exclusives for each platform. Get recruited and earn rank upgrades and sabotage and spy for your team.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/13580/header.jpg", "genre": "Action"}, {"QueryName": "Prince of Persia: The Sands of Time", "ReleaseDate": 2008, "Metacritic": 5, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": true, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Amidst the scorched sands of ancient Persia there is a legend spun in an ancient tongue. It speaks of a time borne by blood and ruled by deceit. Drawn to the dark powers of a magic dagger a young Prince is led to unleash a deadly evil upon a beautiful kingdom. Aided by the wiles of a seductive princess and the absolute powers of the Sands of Time the Prince stages a harrowing quest to reclaim the Palaces cursed chambers and restore peace to his land.A technological masterpiece - Witness some of the most advanced programming in gaming history pushing the limitations of consoles and raising the standards of games in all areas of production: physics lighting graphics animations and more!An unmatched hero - Wielding powers of mythic proportions the Prince returns to action-adventure gaming with gravity-defying acrobatics ferocious fighting skills and the ability to bend time to fulfill his destiny.The Sands of Time - Ubisofts Montreal Studio presents the Sands of Time - a technological breakthrough that will change the face of action-adventure gaming forever. Erase the past behold the future and freeze the present in real-time for unlimited gameplay variations.Exotic worlds and vast kingdoms - Uncover the mysteries of a world never before explored in action-adventure gaming. Medieval Persia mythical and deadly holds a staggering array of landscapes and kingdoms to explore and conquer.A sweeping adventure of betrayal and triumph - The epic legends and deadly creatures of mythic Persia burn to life in this suspense-filled tale featuring more twists and turns than the labyrinthine Palace itself.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/13600/header.jpg", "genre": "Action,Adventure"}, {"QueryName": "Tom Clancy's Ghost Recon: Desert Siege", "ReleaseDate": 2008, "Metacritic": 5, "PriceFinal": 4.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "East Africa 2009. A 60-year conflict boils over as Ethiopia invades its smaller neighbor Eritrea threatening the worlds most vital shipping lanes in the Red Sea. An elite team of U.S. Army Green Berets known as the Ghosts moves in to safeguard the seas and free Eritrea. As the war rages on the Ghosts are drawn from Eritreas shores to the heart of Ethiopia in their deadliest battles yet.New multiplayer modes - Team-based Siege and Domination modes allow teams to attack or defend territory.Both new modes are fully compatible with your original Ghost Recon game - play for hours on the original maps.8 new single-player missions.4 new dedicated multiplayer spaces.9 new multiplayer weapons including the Bizon submachine gun the M98 sniper rifle and the fearsome M-60 machine gun.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/13620/header.jpg", "genre": "Action"}, {"QueryName": "Tom Clancy's Ghost Recon: Island Thunder", "ReleaseDate": 2008, "Metacritic": 5, "PriceFinal": 4.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Ghost Recon takes the next step in battlefield realism with Tom Clancys Ghost Recon™: Island Thunder™.Cuba 2009: Castro is dead and the first free Cuban elections in decades are thrown into turmoil by a drug-funded warlord.  The Ghosts an elite team of U.S. Army Green Berets are sent to Cuba as part of a UN peacekeeping force to destroy the rebel forces and their mercenary leaders and secure the elections for a free Cuba.8 new single player missions in an all-new campaign set across the island of Cuba.5 new dedicated multiplayer maps.12 new multiplayer weapons including the M4 SOCOM rifle and the MM-1 automatic grenade launcher.2 new multiplayer game types.New Cuban enemy vehicles new allied vehicles and insertions by helicopter.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/13630/header.jpg", "genre": "Action"}, {"QueryName": "Tom Clancy's Rainbow Six: Lockdown", "ReleaseDate": 2008, "Metacritic": 3, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Engineered specifically for the PC by Red Storm Entertainment Rainbow Six returns to deliver the tensest close-quarters battles ever experienced online. In this episode Rainbow faces independent terrorist threats tied together by one common element - the Legion virus. Rainbow must determine the connection between the terrorist threats and the virus.Change in story and mission composition - Rainbow faces independent terrorist threats tied together by one common element - the Legion virus. Rainbow must determine the connection between the terrorist threats and the virus.Enhanced tactical gameplay allows you to immerse yourself in tense close-quarter combat where split-second decisions mean the difference between life and death.Superior multiplayer experience - Rainbow Six Lockdown™ has the total multiplayer experience including a revolutionary class-based mode where players choose from four specialized operative classes each with unique gameplay advantages.Advanced weapons and equipment - Complete your mission with all of the tools of the trade including new items like lock fusers laser trip mines and the deadly virus grenades.New classic maps - Rainbow Six Lockdown PC provides nine maps including three new classic Rainbow maps voted on by the fans.Tension-building sound effects (creaking floorboards whispers and hostages begging for their lives) hint at a threat around every corner.Increased visuals - All levels contain increased visuals accomplished by increasing resolution of textures and increasing polygon counts. In addition lighting of spaces dramatically improves the visuals of the game. All new user interface includes new radar element added to the in-game HUD - part of the motion sensor vision mode.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/15000/header.jpg", "genre": "Action"}, {"QueryName": "Rayman: Raving Rabbids", "ReleaseDate": 2008, "Metacritic": 3, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": true, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Hordes of crazed out-of control bunnies have invaded enslaving Rayman and forcing him to participate in gladiator style trials.  Help Rayman win his freedom back by entertaining and outwitting these fury foes. Use the most hilarious fighting moves imaginable. Run races on animals fight in the arena mesmerize the bunnies with your dance moves throw cows milk pigs or engage in plunger shooting madness!  The possibilities for fun are endless.Over 70+ Trials in Unique Stylized Worlds - Pass trials by entertaining the bunnies and unlock new worlds and many collectables such as costumes music and items for Raymans cell.Loads of Hysterical Fighting Moves - Run races on animals fight in the arena dance or engage in toilet plunger- shooting action!Party with friends - Experience frenzied competition with up to 4 players in frantic and quirky multiplayer trials.Dress to Impress - Go punk pop rock or hip hop and use your funky dance moves to entertain the bunnies; keep them moving to your rhythm and collect additional disguises. Become more and more popular and unlock additional items.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/15080/header.jpg", "genre": "Action,Adventure"}, {"QueryName": "Assassin's Creed", "ReleaseDate": 2008, "Metacritic": 4, "PriceFinal": 19.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": true, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Assassins Creed(tm) is the next-gen game developed by Ubisoft Montreal that redefines the action genre. While other games claim to be next-gen with impressive graphics and physics Assassins Creed merges technology game design theme and emotions into a world where you instigate chaos and become a vulnerable yet powerful agent of change.The setting is 1191 AD. The Third Crusade is tearing the Holy Land apart. You Altair intend to stop the hostilities by suppressing both sides of the conflict.You are an Assassin a warrior shrouded in secrecy and feared for your ruthlessness. Your actions can throw your immediate environment into chaos and your existence will shape events during this pivotal moment in history.Be an Assassin - Master the skills tactics and weapons of historys deadliest and most secretive clan of warriors. Plan your attacks strike without mercy and fight your way to escape.Experience exclusive PC content - Four PC-exclusive investigation missions make the game an even better experience than its console predecessors including the Rooftop Race Challenge a race to a specified location and the Archer Stealth Assassination Challenge where the player must assassinate all archers in a certain zone to help out fellow Assassins.Realistic and responsive environments - Experience a living breathing world in which all your actions have consequences. Crowds react to your moves and will either help or hinder you on your quests.Action with a new dimension-total freedom - Eliminate your targets wherever whenever and however. Stalk your prey through richly detailed historically accurate open-ended environments. Scale buildings mount horses blend in with crowds. Do whatever it takes to achieve your objectives.Relive the epic times of the Crusades - Assassins Creed immerses you in the realistic and historical Holy Land of the 12th century featuring life-like graphics ambience and the subtle yet detailed nuances of a living world.Intense action rooted in reality - Experience heavy action blended with fluid and precise animations. Use a wide range of medieval weapons and face your enemies in realistic swordfight duels.Next-gen gameplay - The proprietary engine developed from the ground up for the next-gen console allows organic game design featuring open gameplay intuitive control scheme realistic interaction with environment and a fluid yet sharp combat mechanic.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/15100/header.jpg", "genre": "Action,Adventure"}, {"QueryName": "Tom Clancy's Rainbow Six: Vegas 2", "ReleaseDate": 2008, "Metacritic": 4, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Tom Clancys Rainbow Six(r) Vegas 2 - the sequel to the award-winning next-generation first-person shooter - returns to Sin City. Tom Clancys Rainbow Six Vegas 2 is your last chance to rescue Americas sexiest city from an escalating terrorist siege that will force you into heart-pounding action from beginning to end.  The best are back and this time winner takes all.Recipient of numerous awards including 2006 Best First Person Shooter and Best Online Game Tom Clancys Rainbow Six Vegas 2 pushes the top-selling franchise to new heights with new gameplay features and groundbreaking co-op and multiplayer modes.Ubisoft Montreal Returns - Rainbow Six Vegas 2 is back in the hands of Ubisofts Montreal studio creators of the award-winning and highly acclaimed Rainbow Six Vegas to ensure that ending to the Vegas story is one youll never forget.More Vegas - Sin City is back and bigger than before.  Explore all new Vegas hot spots as the environment changes from dusk to bright daylight to dawn creating a visual experience that is as challenging as it is breathtaking.More Multiplayer - The highly acclaimed multiplayer mode in Tom Clancys Rainbow Six Vegas has been upgraded to include 11 new smaller maps that force more intense face-offs 2 new adversarial modes more rewards and easier access to matches using the improved and intuitive matchmaking system. Unprecedented Customizable Experience - Create your own identity that stays the same in both single player and multiplayer modes and progresses as you do.  Reap the benefits of your single player rewards in multiplayer and vice versa.Vastly Improved Co-op mode - Turn single player mode into co-op mode at any time just by jumping into the game.  Now your friend can jump into your single player game and help you without any change to the story.  Single player maps and storyline were created with co-op in mind which means every map has multiple entry points and the story is the same.Improved AI - AI is more challenging than ever.  Now the terrorists are equipped with thermal vision night vision and shields - not to mention a multitude of varying reactions - all of which are guaranteed to give you a new playing experience every time you go into battle.  As you progress within the game youll only be able to outsmart your enemies by taking advantage of intel opportunities such as thermal scanning and tactical strategies such as leapfrogging.New Weapons and Armor - Take down the terrorists more effectively using 11 new weapons.   New camouflage clothing and gear allow you to take customization to the next level.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/15120/header.jpg", "genre": "Action"}, {"QueryName": "Heroes of Might & Magic V", "ReleaseDate": 2008, "Metacritic": 4, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": true, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Witness the amazing evolution of the genre-defining strategy game as it becomes a next-generation phenomenon melding classic deep fantasy with next-generation visuals and gameplay.In the renowned Might & Magic universe demon swarms spread chaos over the land in a relentless assault. The fate of the world is at stake and Heroes from a variety of legendary factions must stand up to defend their causes. Live their fate lead their forces to victory and unveil the secret goal of the Demon lords.Become a strategy gaming legend by raising unique hero characters assembling armies and defeating enemies using the brand new active-time battle system both offline or online.Cutting edge visual technology: for the first time experience the world of Might & Magic in a full breathtaking 3D animated world supported by a consistent and modern graphic style.Modern sophisticated fantasy universe: includes all features which brought success to the series in a complete revamped and more mature universe with six unique factions and over forty different creatures and over 200 spells.Complete strategy experience and RPG gameplay: during six campaigns and over thirty missions explore and conquer territories manage your cities recruit armies raise and upgrade your heroes through a user friendly yet deep turn-based system.Complete scalable turned-based battle system for challenging and tactical combat: find out the combat system that made the success of the Heroes series or experience the brand new Dynamic Battle system for transforming a chessboard into a lively battlefield.Competitive and addictive intense multiplayer parts: Five multiplayer modes including the new Ghost Mode.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/15170/header.jpg", "genre": "Strategy"}, {"QueryName": "Brothers in Arms: Road to Hill 30", "ReleaseDate": 2008, "Metacritic": 5, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Based on a true story. Set during the famous airdrop before the invasion at Normandy where Sgt. Matt Baker and his squad of 101st Airborne Paratroopers were scattered over the French countryside.As the story unfolds you must choose between the success of your mission and the lives of your men - your brothers in arms.Brothers In Arms: Road to Hill 30 will immerse players in the historic eight-day invasion of Normandy - with unparalleled imagery authenticity sound and gameplay.One of a kind: Brothers In Arms Road to Hill 30 is the only first-person tactical shooter set in WWII.Real military tactics: Intuitive and easy-to-use squad controls appeal to both the hardcore and mainstream gaming audience.Real soldiers: Featuring a cast of more than 20 characters each with a unique personality appearance and style.Revolutionary AI system: Allies and enemies use the standard operating procedures of fire and maneuver to flank and kill their foes.Unprecedented authenticity: Historically accurate and detailed battlefields events and equipment re-created from Army Signal Corps photos aerial reconnaissance imagery and eyewitness accounts.Innovative multiplayer: Players command three-man AI teams in a battle of wits and skill to accomplish exciting objectives.Award-winning team: Gearbox Software creators of Half-Life Opposing Force and developers of James Bond: Nightfire Counter-Strike and Halo (PC).", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/15190/header.jpg", "genre": "Action"}, {"QueryName": "Silent Hunter: Wolves of the Pacific", "ReleaseDate": 2008, "Metacritic": 4, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": true, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Hunt hide and kill as you take command of U.S. submarines and crews and navigate the treacherous waters of the Pacific during WWII.Silent Hunter the industry-leading naval warfare simulation franchise for over a decade returns to its roots with next-generation graphical realism immersive gameplay innovative crew evolution and more action than ever before. Developed by the same Ubisoft team that delivered Silent Hunter 3 the king of sub games to worldwide critical acclaim the 2007 installment offers the most memorable accessible and empowering submarine simulation experience ever.Hollywood Blockbuster experience: Lifelike graphics and spectacular audio/visual effects offer an incredibly immersive gaming experience. Witness the historical accuracy and the amazing attention to detail from the breathtaking Pacific settings to the more than 75 authentic-looking war machines such as the U.S. Gato class submarine the Japanese battleship Yamato and the H6K flying boat.Large Scale Naval Engagements: Epic naval engagements can be witnessed by players either firsthand or via radio messages and orders from high command.Innovative crew evolution: Earn upgrades and experience to guide the evolution path of crewmembers making your men the most effective naval force in the Pacific theater.Immersive single player gameplay: Diverse mission objectives and events combined with unique rewards make each campaign a new experience. Commandeer various U.S. submarines and progress your career as a naval officer via improved dynamic campaigns in Career Mode or dive into instant actions and single patrols for a quick fight.Addictive Online New Adversarial Mode: Join forces with up to 8 friends via LAN or 4 via internet in either cooperative or adversarial gameplay modes. Scripted and generated mission types allow for epic online battles and unlimited replayability.Scalable learning experience: Selectable difficulty levels allow players to choose how challenging of a simulation to play.Easy to control: An upgraded and streamlined interface makes moving around the submarine and controlling it much easier than ever before.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/15200/header.jpg", "genre": "Simulation"}, {"QueryName": "Silent Hunter III", "ReleaseDate": 2008, "Metacritic": 5, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": true, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "The king of submarine simulations returns with an all-new 3D engine new crew command features and more realistic WWII naval action than ever before. The movie-like graphics and simple tension-filled gameplay make this the perfect game for the realism fanatic and the casual gamer.Realistic and immersive environment: The suspense-filled atmosphere includes realistic 3D water modeling day/night cycles and historically accurate subs ships and aircraft. The detailed U-boat interiors changing weather effects and engaging audio represent the ultimate in WWII submarine warfare. A deadly array of U-boats and weapons: Playable U-boats include Type II VII IX and XXI submarines. Take aim against Allied convoys and warships. In recreating the great submarine battles of WWII players will hide in silence just below threatening escort ships fire deadly torpedoes or surface and pound enemies with the deck gun. Dynamic campaign: Create your own realistic naval war story. Your military career will be influenced by successful command decisions in an unscripted and non-linear WWII campaign. Accessible to players of all skill levels: Players will experience a simplified learning curve that will be easier to handle than standard simulations. Use the naval academy tutorial to learn the basics. Customize the realism settings for play that appeals to a variety of WWII combat fans. Command your crew: The crew will take orders and evolve based on the results of each patrol. Multiplayer cooperative play: For up to eight players via LAN.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/15210/header.jpg", "genre": "Simulation"}, {"QueryName": "Blazing Angels 2: Secret Missions of WWII", "ReleaseDate": 2008, "Metacritic": 4, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": true, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Developed by Ubisofts Romania studio Blazing Angels Secret Missions is an intense action-adventure air combat game that takes place during WWII.In this game you are the leader of Operation Wildcard an undercover and elite squad of pilots secretly created by the American government. Your mission is to sabotage and destroy the Third Reichs evil plans to create a weapon of mass destruction. During this mission you and your team discover that the bad guys also have an elite team of their own. In an attempt to disarm the enemy you engage in dramatic and movie-like spy missions in some of the worlds most exotic locations using experimental weapons and flying never-before-seen prototype aircraft.Over-The-Top Action: Engage in 18 high-stakes missions where you will bomb bridges steal secret weapons destroy Zeppelins and more.Fly Never Before Seen Aircraft: Pilot over 50 authentic planes and prototypes including the Gotha Go 229 DH Vampire F Mk 1 Me-163 Komet Meteor and many more.Unusual Experimental Weapons: Get the advantage in combat by using experimental WWII weapons including High Velocity Cannons (such as the German Mk 103) Self-Guided and TV-Guided missiles.Exotic WWII Setting: Engage in epic battles in some of the worlds most captivating environments such as Cairo the Himalayas Moscows Red Square Romes San Pietros Cathedral the Swiss Alps the Baltic Sea Coast and China.Next-Gen Graphics: Discover fully rendered environments and 3D aircraft models designed for next-generation gaming. Experience improved depth of field jaw-dropping cinematographic lightening and outstanding sound effects.Fast Paced Multiplayer Action: Challenge up to 16 players in free-for-all co-op and squad-based missions including the all new Epic Battle and Capture the Flag modes.Epic Boss Battles: For example go up against a giant German Zeppelin over the pyramids of Cairo. Take out its nine gun turrets while you expose its vulnerable underbelly.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/15230/header.jpg", "genre": "Action,Simulation"}, {"QueryName": "Cold Fear", "ReleaseDate": 2008, "Metacritic": 4, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "In a ferocious Arctic storm distress signals are sent from a mysterious Russian whaler. As leading Coast Guard veteran Tom Hansen you board to investigate — and discover unthinkable horrors lurking beneath the ships bloodstained decks.Brave dangerous waters: Rocked by huge breakers you must steady your nerves — and aim — to evade a watery grave.Keep your bearings: Battle against increasingly mutated enemies in treacherous unstable environments.Unleash a torrent of weapons: Create fatal traps and use shotguns flame throwers or any object you can find to survive.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/15270/header.jpg", "genre": "Action"}, {"QueryName": "IL-2 Sturmovik: 1946", "ReleaseDate": 2008, "Metacritic": 5, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": true, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": "Il-2 1946 includes all of the original IL-2 series content: IL-2 Sturmovik(tm): Forgotten Battles Ace Expansion Pack Pacific Fighters(tm) and alternate histry campaigns of year 1946. What was years ago began as a one-aircraft study sim is now an astonishing anthology with a whopping 229 flyable aircraft and over 300 aircraft total!", "DetailedDescrip": "Il-2 1946 includes all of the original IL-2 series content: IL-2 Sturmovik(tm): Forgotten Battles Ace Expansion Pack Pacific Fighters(tm) and alternate histry campaigns of year 1946. What was years ago began as a one-aircraft study sim is now an astonishing anthology with a whopping 229 flyable aircraft and over 300 aircraft total!The game has been updated to the latest version 4.12.2. This community made update includes widescreen support with correct FOV many new planes maps and scenarios.New Aircraft: 32 new flyable fighters and bombers and four new AI aircraft!New Maps: Large new historical maps of the Kiev region; a map of Manchuria focusing on a border region between USSR China and Japanese-occupied Korea; a large bonus Burma map; and an online Khalkin Gol / Nomonhan map.New Campaigns: Nine new campaigns with nearly 200 missions add incredible realism and attention to detail.  There are detailed careers for fighter and bomber pilots for the German Soviet and Japanese air forces offering such varied objectives as flying jet bombers over occupied Europe to intercepting American B-29 Super fortresses over Iwo Jima and Japanese home islands! Alternate History: Three of the nine campaigns are a departure into alternate history focusing on hypothetical battles between the Soviet Union and Germany in the year 1946 while WWII still rages on. Nearly 1000 new Paint schemes: The new planes as well as many of the other ones in the series come with a host of historical paint schemes showing many of the individual aircraft or squadrons that served in WWII.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/15320/header.jpg", "genre": "Simulation"}, {"QueryName": "Tom Clancy's Ghost Recon", "ReleaseDate": 2008, "Metacritic": 5, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Eastern Europe 2008. War has broken out on the borders of Russia and the fate of the world hangs in the balance. Thats when the call goes out for the Ghostsan elite handful of specially trained Green Berets armed with the latest technology and trained to use the deadliest weapons. Their mission: Spearhead the way for a NATO peacekeeping force and keep the lid on the conflict before it mushrooms... literally.                    All the realism sweat and fear from the Game of The Year: Award-winning tension and deadly realism on tomorrows battlefields.                    Multiplayer: Online or LAN multiplayer with up to 36 players.                    Weapons: Standard and special-issue weapons like the M16A2 the M4 carbine and the fearsome and deadly OICW.                    Gameplay: The total combat experience that teaches a deadly realistic lesson in how to fight on tomorrows battlefields.                    Includes: 23 single-player missions 11 multiplayer maps and six multiplayer modes.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/15300/header.jpg", "genre": "Action"}, {"QueryName": "The Settlers: Heritage of Kings", "ReleaseDate": 2008, "Metacritic": 3, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": true, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Heritage of Kings The Settlers is a world-building strategy game with fully rendered 3D visuals and unavoidably addictive gameplay. Players can dive into a detailed medieval world offering a unique mix of RTS and simulation gameplay. A fully functioning community can be created new advancements can be discovered and enemy forces will be repelled!                                         Features:                    20 medieval missions challenge players to create their own realm by conquering seven fantastic kingdoms and retrieving the Orb of Power.                    Dynamic weather and seasons have a direct impact on gameplay.                    Manage more than 70 types of intelligent inhabitants.                    An exciting combat system with upgradeable RPG elements including enhanced abilities weapons and technologies.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/15310/header.jpg", "genre": "Strategy"}, {"QueryName": "IL-2 Sturmovik: 1946", "ReleaseDate": 2008, "Metacritic": 5, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": true, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": "Il-2 1946 includes all of the original IL-2 series content: IL-2 Sturmovik(tm): Forgotten Battles Ace Expansion Pack Pacific Fighters(tm) and alternate histry campaigns of year 1946. What was years ago began as a one-aircraft study sim is now an astonishing anthology with a whopping 229 flyable aircraft and over 300 aircraft total!", "DetailedDescrip": "Il-2 1946 includes all of the original IL-2 series content: IL-2 Sturmovik(tm): Forgotten Battles Ace Expansion Pack Pacific Fighters(tm) and alternate histry campaigns of year 1946. What was years ago began as a one-aircraft study sim is now an astonishing anthology with a whopping 229 flyable aircraft and over 300 aircraft total!The game has been updated to the latest version 4.12.2. This community made update includes widescreen support with correct FOV many new planes maps and scenarios.New Aircraft: 32 new flyable fighters and bombers and four new AI aircraft!New Maps: Large new historical maps of the Kiev region; a map of Manchuria focusing on a border region between USSR China and Japanese-occupied Korea; a large bonus Burma map; and an online Khalkin Gol / Nomonhan map.New Campaigns: Nine new campaigns with nearly 200 missions add incredible realism and attention to detail.  There are detailed careers for fighter and bomber pilots for the German Soviet and Japanese air forces offering such varied objectives as flying jet bombers over occupied Europe to intercepting American B-29 Super fortresses over Iwo Jima and Japanese home islands! Alternate History: Three of the nine campaigns are a departure into alternate history focusing on hypothetical battles between the Soviet Union and Germany in the year 1946 while WWII still rages on. Nearly 1000 new Paint schemes: The new planes as well as many of the other ones in the series come with a host of historical paint schemes showing many of the individual aircraft or squadrons that served in WWII.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/15320/header.jpg", "genre": "Simulation"}, {"QueryName": "Heroes of Might & Magic V: Tribes of the East", "ReleaseDate": 2008, "Metacritic": 4, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": true, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "For the first time play as the Orc faction and recruit heroes build armies and manage cities as you explore and conquer legendary lands. Use tactics skills and magic to outsmart fantasy armies while developing your heroes and unveiling the dark plot that threatens to tear the world of Ashan apart.                                                 Features:                        Every creature in the Heroes V universe will get an alternative upgrade increasing the total number of creatures in the Heroes of Might and Magic V line to over 170!                         Expand your arsenal and gameplay with new spells new artifacts new buildings and innovative new features such as the combo-based Artifact Power Link and Battle Rage the unique racial ability of the Orcs.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/15370/header.jpg", "genre": "Strategy"}, {"QueryName": "Heroes of Might & Magic V: Hammers of Fate", "ReleaseDate": 2008, "Metacritic": 4, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": true, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Take part in a thrilling new adventure in the world of Ashan with the Hammers of Fate expansion. Discover uncharted territories and experience new ways of playing Heroes of Might & Magic V.                                                     Introducing a brand-new Dwarves faction made up of heroic warriors and rune magic adepts who stalk the deepest mountains and most hostile regions of the North.                             Featuring 15 new missions new heroes and improved cut-scenes.                            Includes new spells and abilities 5 new single-player maps 10 new multiplayer maps new buildings new artifacts and new neutral creatures.                            Thanks to new features such as Caravans and a random map generator you will enjoy an even smoother experience and unlimited replayability. In addition the simultaneous turn feature will speed up your online games.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/15380/header.jpg", "genre": "Strategy"}, {"QueryName": "Brothers in Arms: Hell's Highway", "ReleaseDate": 2008, "Metacritic": 4, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Brothers in Arms Hells Highway brings the critically acclaimed squad-based WWII shooter into the next generation of gaming with amazing graphics and sound new cutting-edge gameplay features and a totally redesigned online component.                    Delivering on the franchises compelling story unrivaled authenticity and intense squad-based action Brothers in Arms Hells Highway drops you into Operation Market Garden the largest paratrooper operation in World War II.                                        Brothers in Arms Hells Highway — next generation: The classic authentic squad-based combat series explodes on next-generation hardware offering unprecedented graphics and features.                    New story new setting: Join Matt Baker Joe Hartsock and the rest of the 101st Airborne Division in Operation Market Garden as they fight to open the infamous Hells Highway in a daring bid for a quick end to the war.                     Live the life of an enlisted man: Get orders from HQ go on patrol spot the enemy and set up a devastating ambush. For the first time finding the enemy before they find you is part of the challenge.                    Unprecedented character design: Lifelike characters look talk move and think with incredible realism. Game characters interact with the player and each other like true brothers in arms trading ammunition helping wounded allies and civilians working together to man team-operated weapons and more.                    Rich cinematic experience: As the squad leader you interact with and get to know your brothers. Each character has his own distinct personality unique story and background and grows throughout the game.                    Powerful new units under your command: Players can use or command combined arms teams — machine gun crews create intense fire bazooka crews destroy buildings and tanks and mortar crews pound the enemy from a distance.                     Play your own way: Players can choose to use their squad to execute a tactically elegant flanking maneuver or charge in with guns blazing.                      Destructible cover: Keep your men moving and choose your cover wisely — modeled using real physical properties and behaviors weapons will damage dent scorch and destroy the world around you.                     Completely new multiplayer experience: Fight major multiplayer battles with dozens of players on each side combining all the intensity and accessibility of Deathmatch with the squad-based gameplay that helped make Brothers In Arms famous.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/15390/header.jpg", "genre": "Action"}, {"QueryName": "AaAaAA!!! - A Reckless Disregard for Gravity", "ReleaseDate": 2009, "Metacritic": 5, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": true, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": true, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": "BASE jump through a floating city creating your own stunts to delight your fans. Use quick reflexes to negotiate the intricate tangle of girders that make up the floating city. Flip protesters off for points!", "DetailedDescrip": "Looking for the Oculus Rift version? Want to BASE jump on Mac or Linux? Pick up Aaaaa! for the Awesome.BASE jump through a floating city creating your own stunts to delight your fans.You dive off a skyscraper relying on quick reflexes to negotiate the intricate tangle of girders that make up the floating city. All eyes are on you as the judges mark your score. One hundred points for hugging those exposed struts as you fall. A thousand for planting a kiss on the side of that building. Twisting and turning you thread the needle between two billboards earning cheers from your fans.But while reflexes are important its quick thinking that gets you the win. One block away you spot a crowd of protesters decrying your sport and make a split second decision. You break off course stare them straight in the eye and flip them the finger. They explode into a burst of fury but the judges absolutely love it bumping you up to first place. Now all you have to do is to make that landing without ending up a loose sack of broken bones.Features80 levels take you through cities of floating billboards and buildings and fly you inches away from the side of a mountain.Unique game mechanics allow you to create your own stunts to score.Give your fans the thumbs-up for points or annoy protesters with rude gestures.Snag a can of spray paint and tag government buildings for an extra challenge.Special meditation mode helps you relax with free anti-meditation mode to help you stop relaxing.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/15520/header.jpg", "genre": "Indie,Action,Sports"}, {"QueryName": "Warhammer® 40,000™: Dawn of War® II", "ReleaseDate": 2009, "Metacritic": 5, "PriceFinal": 19.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": true, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": "With a focus on fast-action RTS gameplay Dawn of War II brings to life the science fiction universe of Warhammer 40000 like never before. Experience the intimate brutality of battle as you play through your chosen races epic campaign.", "DetailedDescrip": "ReviewsAbout the GameDeveloped by award winning studio Relic Entertainment Dawn of War II ushers in a new chapter in the acclaimed RTS series - taking players to the brutal frontlines of war to lead an Elite Strike Force on a mission to save the galaxy.Its the 41st Millennium in the Sub-Sector Aurelia - a cluster of worlds on the edge of the galaxy - where a battle of epic proportions is about to commence. Ancient races will clash across the planets that dot this sector of space battling for the greatest of stakes - not only for control of Sub-Sector Aurelia - but the fate of each race.With a focus on fast-action RTS gameplay Dawn of War II brings to life the science fiction universe of Warhammer 40000 like never before. Experience the intimate brutality of battle as you play through your chosen races epic campaign. Clash with the enemies on battlefield ablaze with visceral melee and ranged combat. Lead and develop your squads from raw recruits into the most battle hardened veterans in the galaxy. Also included is The Last Stand a co-operative game mode featuring user controlled heroes fighting waves of enemies.Brutal Frontline Action & TacticsGet straight into the action to experience intense melee and devastating ranged combat. Use vicious melee sync-kills to obliterate your enemies. Outsmart your opponents using dynamic and destructible environments to suppress flank and destroy your foes.Non-Linear Single Player CampaignCommand an elite strike force developing the skills and abilities of your squads and commander as you progress through the game.Co-Op MultiplayerPlay through the entire single player campaign co-operatively with a friend at any point in the game anytime.Next Generation RTS EngineUtilizing Relics proprietary Essence Engine 2.0 Dawn of War II delivers cinematic visuals detailed graphics and amazing special effects.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/15620/header.jpg", "genre": "Strategy"}, {"QueryName": "Everyday Shooter", "ReleaseDate": 2008, "Metacritic": 4, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": true, "GenreIsAction": false, "GenreIsAdventure": false, "GenreIsCasual": true, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Everyday Shooter is an album of games exploring the expressive power of abstract shooters. Dissolute sounds of destruction are replaced with guitar riffs harmonizing over an all-guitar soundtrack while modulating shapes celebrate the flowing beauty of geometry.Play through different levels each with a completely unique musical graphical and gameplay style. Shoot to trigger musical sounds and riffs that combine to form the final soundscape of the game. Use points earned in the game to unlock extra lives shuffle mode and different visual filters.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/16300/header.jpg", "genre": "Indie,Casual"}, {"QueryName": "F.E.A.R. 2: Project Origin", "ReleaseDate": 2009, "Metacritic": 4, "PriceFinal": 14.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Deployed just minutes before the blast triggered by the original F.E.A.R. team you assume the role of Special Forces Sgt. Michael Becket as your routine mission quickly turns into a fight for survival against the wrath of Alma Wade. As Almas terrifying power surges out of control your squad is forced to battle through an apocalyptic landscape in search of clues for how to destroy her!                    Strategic environmental combat opportunities available to both you and your enemies                     Slow  time using your characters enhanced reflexes                     In your face close-quarter action in a variety of indoor and outdoor environments                     Battle all-new enemies that employ advanced combat tactics                     Test your nerves and face your FEARS as you battle new characters and unravel a terrifying mystery                     Utilize the world interaction enhancements to create instant cover or remove obstacles                     Play with and against friends in multiplayer competition                     Enhanced graphics engine takes action horror to new heights through enhanced visuals and effects                     Enemies behave realistically and use the environment against you through vastly enhanced enemy Artificial Intelligence                      Maintains the authenticity of the Alma storyline and players will know this is the only place to continue the saga ABOUT TOY SOLDIER UPDATEToy Soldier Update (April 16 2009) - Experience FEAR 2 multiplayer from a new perspective. Players are only inches tall as they battle inside a pinball machine a hospital lab room and a playground sandbox. FullTilt: Battle inside a retro 1970s era pinball machine Snake Fist style! Flippers targets spinners and pop-bumpers provide cover for the fast paced action. Multi-level playfield and authentic sounds set the mood for destruction! Cockroach: A blood drenched hospital room filled with heart pounding action. Climb up electrical cords laboratory equipment and pill bottles in a tightly connected environment. Recess: Wage mayhem from the top of a giant sandcastle to the cockpit of a toy bulldozer! Go commando and blend in with plastic army men!", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/16450/header.jpg", "genre": "Action"}, {"QueryName": "Insecticide Part 1", "ReleaseDate": 2008, "Metacritic": 4, "PriceFinal": 1.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": true, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Enter the fast shooting world of INSECTICIDE as hot shot rookie Detective Chrys Liszt and help solve a crime of epic proportions.  Lead your team on a bug hunt collecting clues and solving puzzles. Use old-fashioned street smarts unique insect abilities and an arsenal of ingenious bug weapons to confront your suspects.  Explore a futuristic world of mutant insects and uncover the truth in a city infested with corruption.It wont be easy solving this mystery but some buggys got to do it!Action Detective ShooterReal-time 3D third-person view combines action-based platforming with weapons-based combat.Use specialized bug weaponry and unique insect abilities.Adventure Detective Puzzles and Crime SolvingPut your detective skills to the test and lead a crime investigation in a futuristic world of mutant insects and film noir locations.Collect clues to solving a gripping mystery brimming with twists turns and double-crossings. Interrogate suspects interview witnesses and play good cop/bad cop to get the info you need.An immersive story worthy of the best detective flicksA cast of nearly 30 unique characters woven into an addictive plotline where each clue reveals a deeper part of the mystery.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/16710/header.jpg", "genre": "Action,Adventure"}, {"QueryName": "Velvet Assassin", "ReleaseDate": 2009, "Metacritic": 4, "PriceFinal": 4.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": true, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Inspired by the fascinating story and unbreakable spirit of British secret agent Violette Szabo players take control of Violette Summer a beautiful World War II spy deep behind enemy lines with no support or official backing from the British Government. Intense stealth action game play with a startling real-time lighting system and surreal visuals combine to produce an incredible gaming experience. Through third person game play sneak up on enemies and pull the pins from their belted grenades. Infiltrate a Gestapo prison and slip cyanide to your own men before the Germans make them talk. And slink through the shadows to finish off your unsuspecting enemies with a single silent move. Through Violettes fever dreams experience what she experienced. Walk where she walked. And kill those she killed.Stealth assasinations - Execute over 50 different brutal maneuvers to deliver a quick and silent death to enemy soldiers or use the environment itself to take down Violettes foes.Dynamic lighting and shadows - Slip into the darkness of Nazi-controlled Europe and avoid the relentless searchlights of German guards that cut through your shadowy cover.Stylized environments - Explore surreal dreamlike settings that are modeled after actual World War II locations. Unique perspective - Experience the unimaginable horrors of war through Violettes fever dreams. Shift into Morphine Mode when Violettes memories betray her to reposition and gain an advantage against opposing forces.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/16720/header.jpg", "genre": "Action"}, {"QueryName": "Legendary", "ReleaseDate": 2008, "Metacritic": 3, "PriceFinal": 2.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "All creatures of ancient myth legend and lore are real  theyve just been sealed away for thousands of years inside Pandoras Box waiting...                    When a thief named Deckard is hired to steal an ancient artifact he unwittingly triggers a war between man and myth.                    Griffons rule the skies Werewolves tear the innocent limb from limb and cities are held under siege as creatures wed dismissed as imaginings of our ancestors prove to be very real and very angry for being held prisoner for untold millennia.                    As the only person able to return these creatures to the box Deckard finds that he must work with a shadowy secret society to save civilization before it is torn apart by tooth and claw.                    A mythical first person shooter set in an unprepared modern world.                    A massive blockbuster movie experience  society collapses around you as man and machine take on beasts of legend in spectacular battle.                    Awe-inspiring fire-fights where high caliber ordinance meets beak talon fang and claw.                    Dynamic environments crumble around you as you and your enemies tear a living breathing environment apart in your battle to stay alive.                    Devastation realized on an unprecedented scale.  See London burn to the ground and witness New York torn apart through spectacular supernatural destruction.                    The enemy of your enemy is your enemy  witness and take part in three way battles as you combat the supernatural as well as the militant arm of an age old clandestine organization who prove to be a formidable opponent and adequate prey for the armies of mythical beasts.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/16730/header.jpg", "genre": "Action"}, {"QueryName": "Sid Meier's Civilization IV: Colonization", "ReleaseDate": 2008, "Metacritic": 5, "PriceFinal": 19.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": true, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": true, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Sid Meiers Civilization IV: Colonization is the third offering in the award winning Civilization IV series. A re-imagining of the classic Colonization game Sid Meier created in 1994 Sid Meiers Civilization IV: Colonization is a total conversion of the Civilization IV engine into a game experience in which players will lead a European nation on their quest to colonize and thrive in the New World. Players will be challenged to guide their people from the oppressive motherland discover a New World negotiate trade and fight as they acquire great power and battle for their freedom and independence.Classic Game Design Rebuilt for the Modern Era: Usher forth a new generation of Sid Meiers Colonization gameplay built on the award-winning Civilization IV engine providing the beautiful visuals famously addictive gameplay and endless fun that are synonymous with Sid Meier strategy games.Fight the Homeland and Establish a New Nation: Play as the English Spanish French or the Dutch and journey to a brave new world in search of freedom from your oppressive homeland.Improved Diplomacy: Sustain peace and support your followers as you engage in advanced negotiations with natives other colonists and the hostile homeland - Trade resources gold and land as you build the foundation for a self-sufficient and powerful colony.Historical Figures Provide Adaptive Gameplay: Acquire founding fathers such as John Smith Patrick Henry and Samuel Adams who will help guide your nation to freedom based on your gameplay style.Brand New Interface: Both Civilization IV fans and players new to the series will feel right at home with an interface that Firaxis has built to be accessible and easy to navigate.Multiplayer Offers Endless Replay Value: Compete with friends from all over the world via the Internet and Play by Email modes or compete locally via the Hotseat and LAN modes offering endless ways to conquer the New World.Mods & Community Tools: Players will have limitless options for modifying the game to suit their needs. Firaxis will ship the game with modding tools including a map editor using XML and Python.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/16810/header.jpg", "genre": "Strategy"}, {"QueryName": "Tribes: Ascend", "ReleaseDate": 2012, "Metacritic": 5, "PriceFinal": 0.0, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": true, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": "This edition packages weapon DLC from ten previous expansions as well new featured content.", "DetailedDescrip": "Special EditionAbout the GameTribes: Ascend is the worlds fastest shooter - a high-adrenaline online multiplayer FPS with jetpacks skiing vehicles and multiple classes. The classic shooter franchise Tribes has been played by well over 1 million people. With Tribes: Ascend the franchise is reborn - fast-paced vertical acrobatic combat combined with class-based teamwork and stunning sci-fi visuals.Key Features:Skiing: A slow soldier is a dead soldier. By holding down space bar you remove friction and build momentum to traverse large maps hunt down targets and escape enemy territory at intense speeds.Jetpacks: Total freedom of movement and aerial dog-fight like combat. Class-Based Combat: Unlock up to nine distinct classes each with unique weapon loadouts and abilities.Player Progression: As you play a class you gain experience which is used to unlock class-specific skills and perks. You can also share the xp gained while playing a favorite class to progress other classes.Escalating Intensity: In each match you earn credits for shooting down enemies or supporting your teams objectives. Use these match credits to upgrade base defenses access vehicles or call-in tactical strikes. The longer you play the more chaotic the match becomes.Vehicles: Pilot the powerful Beowulf tank the speedy two-person Grav Cycle or the versatile flying Shrike. Beautiful Massive Battlefields: Wage war in a variety of open environments including frozen wastelands sprawling cities and jagged mountains.Dont Fight Alone: Friend-list allows you to link up with others and establish supremacy online Free To Play... but not pay to win: All items affecting game play can be earned by playing the game itself. Players can purchase optional Tribes Gold to unlock classes more quickly and/or skills more quickly. Players will also be able to purchase cosmetic skins with Tribes Gold.Spectator Mode: Highly-detailed spectator mode allows you to zoom in on your favorite players view player data and switch between action hot spots on the fly.", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/17080/header.jpg", "genre": "Action,FreeToPlay"}, {"QueryName": "Children of the Nile", "ReleaseDate": 2008, "Metacritic": 4, "PriceFinal": 7.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": true, "GenreIsRPG": false, "GenreIsSimulation": true, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "Children of the Nile™ is a unique gem of a city-building game unparalleled in both grandeur and attention to detail.As Pharaoh you will guide your people through thousands of years of history: from simple hunter-gatherers to the creation of an immortal civilization. Guide your people well and you will build breathtaking pyramids explore the ancient world and wage war against your enemies.Every inhabitant of your city is a fully developed living person - part of an individual family and household with wants and needs. From priests to entertainers scribes to laborers even the royal family... everyone will need to eat and thats just the beginning. Every block of stone that is hauled to your pyramid will be pulled by people who pray to the gods in temples of your choosing. Under your supervision local economies will thrive as goods from reed baskets to gold jewelry will be created purchased and enjoyed by the inhabitants of your city.To achieve immortality a Pharaoh must look outside his citys borders and make an impact on the world. Explore and open trade with foreign neighbors and you will have reason to build commemorative wonders that will tell the tale of your dynasty for all time. As your prestige rises so too will your ability to draw more people to your ambitious endeavors and build cities that are truly epic.How will your dynasty be remembered?", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/17100/header.jpg", "genre": "Strategy,Simulation"}, {"QueryName": "Hinterland", "ReleaseDate": 2008, "Metacritic": 4, "PriceFinal": 9.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": false, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": true, "GenreIsRPG": true, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "June 11 2009 - Update                     Two new playable Orc classes: Lord (Warrior) or Shaman.                    Expanded gameplay: Orcs consume twice as much food learn martial skills faster manufacture items slower and the Shaman uses totems to summon creatures.                    Several new items regardless of character class.                                         About HinterlandLoot level and build with fast paced RPG combat and strategic base building!                    Can you build a vibrant settlement lead your people to prosperity and tame the wild Hinterland?                    Party-based RPG Action  A variety of characters weapons and strategies are at your disposal -- will you lead the charge with a devastating two-handed strike or stand behind the herder in plate mail with your trusty bow?                    Town Building  Choose your settlers from a huge cast of characters and arm them for defense or give them tools for production.                    Character Development  Develop lowly farmers into great warriors and customize your character with a variety of specializations.                    Random fantasy world  Each game of Hinterland takes place in a new location with different resources items and challenges. Different challenges feature a range of enemies including orc war camps dark elf raiding parties goblin infested mines ruined cities filled with undead and more.                    Customizable Gameplay  From a hardcore game to a world without raiders you make the choice about the type of game you want to play.                    Hinterland is a new type of role-playing strategy game from the developers of Children of the Nile(tm) Caesar IV(tm) and SimCity Societies(tm).", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/17140/header.jpg", "genre": "Strategy,RPG"}, {"QueryName": "Crysis", "ReleaseDate": 2008, "Metacritic": 5, "PriceFinal": 19.99, "PlatformWindows": true, "PlatformLinux": false, "PlatformMac": false, "GenreIsIndie": false, "GenreIsAction": true, "GenreIsAdventure": false, "GenreIsCasual": false, "GenreIsStrategy": false, "GenreIsRPG": false, "GenreIsSimulation": false, "GenreIsEarlyAccess": false, "GenreIsFreeToPlay": false, "GenreIsSports": false, "GenreIsRacing": false, "GenreIsMassivelyMultiplayer": false, "ShortDescrip": " ", "DetailedDescrip": "MultiplayerNOTE: GameSpy has ended hosted multiplayer services for this game. As of June 2014 our friends at GameSpy have ended all hosted game services which will affect the online multiplayer aspect of this game. Because of technical challenges and concerns EA does not have a solution to keep these services up and running at this time and online services for this game and other EA games on the GameSpy platform have ended. About the GameAdapt to Survive  An epic story thrusts players into an ever-changing environment forcing them to adapt their tactics and approach to conquer battlefields ranging from newly frozen jungle to zero-gravity alien environments.Suit up!  A high-tech Nanosuit allows gamers to augment their abilities in real time on the battlefield. Players can choose to enhance their speed strength armor and cloaking abilities to approach situations in creative tactical ways.Customizable Weaponry  A huge arsenal of modular weaponry gives gamers unprecedented control over their play style. Blow the opposition away with experimental weapons discover alien technology and utilize custom ammunition from incendiary-tipped rounds to tactical munitions that can silently put foes to sleep.Veni Vidi Vici  Lifelike enemy AI challenges players to assess a situation and approach it strategically. It isnt about having the fastest trigger finger  players are challenged to be proactive in the fight not reactive.Zero-G Gameplay  Battle a horrifying alien species in a true Zero-gravity environment where physics change everything as players must adapt to moving in Zero-G and contending with the recoil from their weapons and more.Next-Generation Graphics  Built from the ground up using Cryteks proprietary CryENGINE 2(tm) Crysis visuals define state of the art with full DX10 support and scalable options to deliver solid performance on older machines.Open Physicalized World  Choose your own path through the open world of Crysis destroying obstacles driving vehicles from VTOLs to boats and using the environment itself against your enemies.[/b]", "logo": "https://cdn.cloudflare.steamstatic.com/steam/apps/17300/header.jpg", "genre": "Action"}]